{"index": {"_id":"1"}}
{"detailed description": "Microsoft's ASP.NET Community Starter Kit (CSK) is a powerful, freely available application that allows you to quickly create a fully featured community-driven website, complete with article and news management, downloads, forums, and user handling. Supported and tested by thousands of developers in the ASP.NET community across the world, the Community Starter Kit offers you the luxury of a scalable and extensible architecture, and the ability to brand your own site. This book will take you inside the Community Starter Kit, allowing you to harness its power for easily creating your own websites. The book is structured to help you understand, implement and extend the Community Starter Kit:\n\r\r\n\n\r\r\n\nUnderstand how the Community Starter Kit works. \n\r\r\n\nBuild the skills to implement your own site. \n\r\r\n\nDevelop the confidence to extend the system for your own needs. \n\r\r\n\n\r\r\n\nWith this book, you will learn how to:\n\r\r\n\n\r\r\n\nInstall and configure the CSK \n\r\r\n\nFind your way around the CSKs towering range of features \n\r\r\n\nCreate and administer community websites \n\r\r\n\nBecome familiar with the common CSK ASP.NET controls \n\r\r\n\nCustomize your CSK site \n\r\r\n\nDiscover the secrets of the CSK core architecture \n\r\r\n\nExplore the inner workings of CSK modules \n\r\r\n\nExtend the CSK by creating new modules \n\r\r\n\nCustomize existing modules with Web controls \n\r\r\n\nAdd an RSS feed to share your content with others \n\r\r\n\nDeploy your CSK website \n\r\r\n\n\r\r\n\nThis book is for ASP.NET developers with a sound grasp of C# and access to Visual Studio .NET. This book uses the Visual Studio. NET version of the ASP.NET Community Starter Kit available from \nhttp://www.asp.net/StarterKits/", "isbn": "1904811000", "title": "Building Websites with the ASP.NET Community Starter Kit", "price_gbp": 34, "audience": "This book has been written for ASP.NET developers with a sound grasp of C# and access to Visual Studio .NET. This book uses the Visual Studio. NET version of the ASP.NET Community Starter Kit.", "authors": ["Cristian Darie", "K. Scott Allen"], "subtitle": "NULL", "topics": [".NET", "Microsoft", "Microsoft Development ", "All Books", "Web Development"], " ": "2004-05-07"}
{"index": {"_id":"2"}}
{"detailed description": "This book takes you through the process of creating content-rich websites and applications using OpenCms. Although powerful and flexible, OpenCms can be daunting on first approach, but its advanced features reward the investment in learning. This book exists to ease Java developers into getting the most from OpenCms.\n\r\r\n\nOpenCms \nOpenCms is a professional-level, open source Website Content Management System, with which you can create and manage complex websites. Based on Java and XML technology, it fits into almost any modern IT environment. With hard-won experience of the practical difficulties faced by developers working with OpenCms, this book is the embodiment of the author's expertise, and the perfect way to master the system.", "isbn": "1904811043", "title": "Building Websites with OpenCms", "price_gbp": 30, "audience": "If you are a web developer new to OpenCms, or are an experienced OpenCms developer who is looking to get the most from the system, then this is the book for you. A working knowledge of Java, JSP, and XML is required to get the most from OpenCms, and from this book. ", "authors": ["Matt Butcher"], "subtitle": "NULL", "topics": ["Open Source", "Java", "Content Management (CMS)", "All Books", "CMS and eCommerce"], "publication date": "2004-07-08"}
{"index": {"_id":"3"}}
{"detailed description": "Web services provide the core functionality for distributed e-business applications using SOAP, WSDL and UDDI.  These building blocks can then be orchestrated into a complete business process using BPEL4WS. \nBPEL\nWeb services provide the basic technical platform required for application interoperability. They do not, however, provide higher level control, such as which web services need to be invoked, which operations should be called and in what sequence. Nor do they provide ways to describe the semantics of interfaces, the workflows, or e-business processes. BPEL is the missing link to assemble and integrate web services into a real business process\nBPEL4WS standardizes process automation between web services. This applies both within the enterprise, where BPEL4WS is used to integrate previously isolated systems, and between enterprises, where BPEL4WS enables easier and more effective integration with business partners. \nIn providing a standard descriptive structure BPEL4WS enables enterprises to define their business processes during the design phase. Wider business benefits can flow from this through business process optimization, reengineering, and the selection of most appropriate processes .\nSupported by major vendors including BEA, Hewlett-Packard, IBM, Microsoft, Novell, Oracle, SAP, Sun, and others BPEL4WS is becoming the accepted standard for business process management. \nThis book provides detailed coverage of BPEL4WS, its syntax, and where, and how, it is used. \nIt begins with an overview of web services, showing both the foundation of, and need for, BPEL. The web services orchestration stack is explained, including standards such as WS-Security, WS-Coordination, WS-Transaction, WS-Addressing, and others. The BPEL language itself is explained in detail, with Code snippets and complete examples illustrating both its syntax and typical construction. Having covered BPEL itself, the book then goes on to show BPEL is used in context. by providing an overview of major BPEL4WS servers. It covers the Oracle BPEL Process Manager and Microsoft BizTalk Server 2004 in detail, and shows how to write BPEL4WS solutions using these servers.", "isbn": "1904811183", "title": "Business Process Execution Language for Web Services", "price_gbp": 44, "audience": "This book aimed at technical architects and developers in the technical design phase of advanced e-business solutions dealing with the issues of orchestration, transactions, coordination, and security. The book presumes knowledge of XML and web services (SOAP, WSDL, UDDI), Web services development (either on J2EE or .NET), and Multi-tier architectures.\n \n \n\r\r\n ", "authors": ["Matjaz B. Juric", "Benny Mathew"], "subtitle": "NULL", "topics": ["All Books", "Web Services", "BPEL", "Enterprise", "Enterprise Products and Platforms"], "publication date": "2004-10-21"}
{"index": {"_id":"4"}}
{"detailed description": "Built on the powerful and popular Zope application server, Plone is widely believed to be the best and most powerful open source content management system. Many regard it as the equal of, or superior to, commercially available CMS.\n\r\r\n\nPlone\nPlone is an open source content management system built on the powerful object-oriented Zope application server. Easy to use, powerful, extensible, and well-supported by an extensive team of developers and contributors, Plone has quickly become one of the most popular open source content management servers.\n\r\r\n\nPlone has support for internationalization, complies with accessibility and usability standards, can run on various platforms, and is highly extensible. Plone is ideal as an intranet and extranet server, document publishing system, portal server, and a groupware tool for collaboration between separately located entities.\n\r\r\n\nLike any feature-rich, complex system, Plone can have a steep initial learning curve. This makes good documentation essential for both the beginner and expert alike. For users new to Plone, this book provides a structured pathway through set up and initial customization. Experienced Plone developers will learn how to leverage the full capability of this powerful application.", "isbn": "1904811027", "title": "Building Websites with Plone", "price_gbp": 36, "audience": "Requiring only a basic knowledge of Zope and Python, this book is valuable for both beginners and experienced Plone developers.", "authors": ["Cameron Cooper"], "subtitle": "NULL", "topics": ["Content Management (CMS)", "Open Source", "All Books", "Plone", "Free eBooks", "CMS and eCommerce"], "publication date": "2004-11-25"}
{"index": {"_id":"5"}}
{"detailed description": "Microsoft Content Management Server 2002 is a dynamic web publishing system with which you can build websites quickly and cost-efficiently. MCMS provides the administration, authoring, and data management functionality, and you provide the website interface, logic, and workflow. Once your website is up and running, your content contributors can add and edit content on their own, without the need to work with developers or the IT department.\n \n First time developers of Microsoft Content Management Server 2002 face a relatively steep learning curve. Not only are they expected to be conversant in the Microsoft .NET Framework, they are also required to be familiar with the concepts of MCMS 2002. \n \n Many beginners to MCMS start out by looking at the example site that ships with the product; tweaking it, dissecting it and turning it inside out using the obscure code comments as markers. However, when it comes to starting their own website from scratch, many are baffled ? where do they begin?\n \n This book exists to answer that question; teaching the essential concepts of MCMS 2002 in a clear, straightforward and practical manner.\n \n Containing answers to some of the most asked questions in developer newsgroups, this book is a treasure trove of tricks and tips for solving the problems faced by MCMS developers.\n \n This is a unique resource focused exclusively on the needs of developers using MCMS. It doesn?t waste time and pages on user or administrator level information that is well covered in other documentation. It?s a distillation of practical experience that developers need to get results, fast. The authors carefully structured example project complements and extends the knowledge gained from an initial look at the examples that ship with MCMS.", "isbn": "1904811167", "title": "Building Websites with Microsoft Content Management Server", "price_gbp": 44, "audience": "This book is written for developers who are part of a dynamic organization that has decided to evaluate or deploy MCMS and require the skills to make it happen.The book presumes a working knowledge of the .NET Framework and familiarity with the C# language, but no prior knowledge of MCMS is required. To use this book, you will need access to Visual Studio. NET 2002 or 2003, SQL Server 2000, and an installation of MCMS 2002.\n \n This book is not aimed at the specific information needs of administrators or users of MCMS.", "authors": ["Stefan Goßner", "Lim Mei Ying", "Joel Ward"], "subtitle": "Errata type:HtmlStrippingPlaceholderDefinition | Page number:376 \n\r\r\n\nIn the listing of properties and values for the \nHtmlStrippingPlaceholderDefinition\n setting, \nAction\n \nshould be:\n read \nTagAction\n\r\r\n\n ", "topics": ["Content Management (CMS)", "Web Development", "Enterprise", "All Books", "Microsoft Servers", "Microsoft", "Enterprise Products and Platforms"], "publication date": "2005-01-06"}
{"index": {"_id":"6"}}
{"detailed description": "DotNetNuke\nDotNetNuke is a free, open source evolution of Microsoft's celebrated ASP.NET reference implementation, the IBuySpy Portal Solution Kit. DotNetNuke began life as a framework for constructing data-driven intranet and Internet portal applications. It has now developed into an advanced web content management system with tools to manage a dynamic and interactive data-driven website.\nIf you work with ASP.NET and VB.NET, and want an interactive website, with forums, news and image management, where visitors can register, participate and contribute to your site, then DotNetNuke is the ideal solution for you. This book is your indispensable guide to creating content-rich websites with DotNetNuke 3.0, as quickly as possible.\nThe first part of this book gives you a deep understanding of working with basic DotNetNuke sites, guiding you through the features and giving you the confidence to create and manage your own site. After that, you will journey to the heart of DotNetNuke, and learn about its core architecture. From there, you will learn how to customize DotNetNuke sites through skinning and creating custom modules. \nEnhancing your site with forums and ecommerce functionality, creating multiple sites and deploying your site round off the book. You will master each of these topics as you leap into the development of a DotNetNuke 3.0 site.", "isbn": "1904811272", "title": "Building Websites with VB.NET and DotNetNuke 3.0", "price_gbp": 30, "audience": "This book has been written for both the beginner wanting to set up a website and also ASP.NET developers with a grasp of VB.NET and access to Visual Studio .NET. No prior knowledge of DotNetNuke is assumed. \nThe new features of DotNetNuke 3.0 are discussed extensively, so even if you have worked with previous versions of DotNetNuke, you will find something new.\nTable of Contents", "authors": ["Daniel N. Egan"], "subtitle": "NULL", "topics": ["All Books", "Microsoft", "Content Management (CMS)", ".NET", "DotNetNuke", "Microsoft Development ", "Open Source", "CMS and eCommerce"], "publication date": "2005-03-09"}
{"index": {"_id":"7"}}
{"detailed description": "phpBB is a free, open source Internet community application, with outstanding discussion forums and membership management. Written in the PHP scripting language, and making use of the popular MySQL database, phpBB is a standard among web hosting companies throughout the world, and is one of the most widely-used bulletin board packages in the world. phpBB short-circuits the need for you to be a web development master in order to create and manage massive online communities. \n phpBB handles sites of all sizes, the largest known phpBB-powered site on the Internet handles over 1.5 million members and has 191 million posts to the forums!\n The book begins with the initial installation and configuration of phpBB on your system, with troubleshooting tips to help you through. You will then go on a tour of phpBB and its features, stepping you through the basic tasks, growing your understanding and familiarizing you with the power of phpBB. \n Everybody wants their community to look special, and customizing your forum is the next stop in the book. Beginning with a detailed rundown of styles and themes, you will then see how to customize your forum by first modifying existing styles, adding new elements, and even creating a new style from scratch. \n The book then goes onto cover further administration of your community, creating hacks or \"modifications\" for phpBB, custom PHP programming with phpBB, and reference appendices with more phpBB resources, the phpBB file and directory structure, guides to the BBCode and permission systems, and the phpBB database structure round off this book.", "isbn": "1904811132", "title": "Building Online Communities with phpBB", "price_gbp": 28, "audience": "This book is written by phpBB enthusiasts for new and intermediate users. It's ideal if you are just starting with online communities and want a powerful and free tool, or if you've already started with phpBB and want to take it further. Anyone with a basic knowledge of HTML and a willingness to learn about phpBB will benefit from this book.", "authors": ["Stoyan Stefanov", "Mike Lothar", "Jeremy Rogers"], "subtitle": "NULL", "topics": ["Open Source", "Free eBooks", "All Books", "Other"], "publication date": "2005-05-10"}
{"index": {"_id":"8"}}
{"detailed description": "Mambo is a mature and fully featured Content Management System (CMS). First released in 2001, the system is now on release 4.5.x and is supported by an active and well organized open source development team and community. Mambo is both easy to use at the entry level for creating basic websites, whilst having the power and flexibility to support complex web applications.\nMambo implements the core requirements of a full featured CMS. It has a powerful and extensible templating system with the ability to upload and manage many different data types. User access control, content approval, rich administrative control, content display scheduling are all built-in. New features and extensions are constantly added to the core system, with many more being available and supported by the community.\nThe book begins by introducing Mambo and concepts behind content management. Then the installation of Mambo, and its supporting software [Apache/MySQL/PHP] is covered clearly and simply.  Once you have the installation up and running, we then take a tour of Mambo as it appears out of the box, to familiarize ourselves with how it works and what is what. As you take the tour, your own ideas for what you need in your new website begin to crystallise around what you can see Mambo is capable of.\nWe then build our web application, using the features of Mambo that are essential to our purpose. We try not to spend time on things that dont matter at this point. Once we have a base version of our site up, we then learn how to change its appearance and feature set to suit our particular requirements, including bringing it into line with an established corporate identity. At the end of the book we show how, if you have the skills and the need, you can add your own extensions to Mambo.", "isbn": "1904811736", "title": "Building Websites with Mambo", "price_gbp": 30, "audience": "This book is suitable for web developers, designers, webmasters, content editors and marketing professionals who want develop a fully featured web presence in a simple and straightforward process. It does not require any detailed knowledge of programming or web development, and any IT confident individual will be able to use the book to produce an impressive web site.", "authors": ["Hagen Graf"], "subtitle": "A step by step tutorial", "topics": ["Open Source", "Content Management (CMS)", "All Books", "CMS and eCommerce"], "publication date": "2005-08-25"}
{"index": {"_id":"9"}}
{"detailed description": "Asterisk is a powerful and flexible open source framework for building feature-rich telephony systems. As a Private Branch Exchange (PBX) which connects one or more telephones, and usually connects to one or more telephone lines, Asterisk offers very advanced features, including station-to-station calls, line trunking, call distribution, call detail rerecords, and call recording.\n \n Asterisk can be used to provide Interactive Voice Response (IVR). The power and flexibility of a programmable phone system gives us the ability to respond to our customers in meaningful ways. \n \n Asterisk has also a fully-functional voicemail system included. It supports voicemail contexts so that multiple organizations can be hosted from the same server.  It supports different time zones so that users can track when their phone calls come in.  It even provides the option to notify the recipient of new messages via email.  In fact, we can even attach the message in audio!\n \n Finally, Asterisk is a Voice Over IP (VoIP) system. The benefits of VoIP are numerous. For instance, we can have multiple users using the same Asterisk service from a variety of locations; we can have users in the local office using PSTN phones or IP phones; we can have remote VoIP users; we can even have entire Asterisk systems operated and run completely separately but with integrated routing; We can have an extension anywhere we have a reasonably fast Internet connection, which means employees can have an extension on the phone system at home if they have a broadband connection. The benefits are too many to list.\n \n Flexibility often means complexity, and this is true in the case of Asterisk. This book is all you need to understand and use Asterisk to build the telephony system that meets your need. You will learn how to use the many features that Asterisk provides you with.", "isbn": "1904811159", "title": "Building Telephony Systems With Asterisk", "price_gbp": 23, "audience": "This book is aimed at anyone who is interested in building a powerful telephony system using the free and open source application, Asterisk, without spending many thousands of dollars buying a commercial and often less flexible system.\n \n This book is suitable for the novice and those new to Asterisk and telephony. Telephony or Linux experience will be helpful, but not required.", "authors": ["Barrie Dempster", "David Gomillion"], "subtitle": "NULL", "topics": ["Open Source", "Networking & Telephony", "Linux Servers", "All Books", "Networking and Servers"], "publication date": "2005-09-30"}
{"index": {"_id":"10"}}
{"detailed description": "Microsoft Content Management Server 2002 is a dynamic web publishing system with which you can build websites quickly and cost-efficiently. MCMS provides the administration, authoring, and data management functionality, and you provide the website interface, logic, and workflow.  Microsoft SharePoint Portal Server (SPS) also features in the book. SPS 2003 enables enterprises to deploy an intelligent portal that seamlessly connects users, teams, and knowledge so that people can take advantage of relevant information across business processes to help them work more efficiently.\nYou've mastered the basics of MCMS, and setup your own MCMS installation. You've only scratched the surface. This book is your gateway to squeezing every penny from your investment in MCMS and SPS, and making these two applications work together to provide an outstanding richness of content delivery and easy maintainability. \nAs a developer, the Publishing API (PAPI) is at the heart of your work with MCMS, and this book starts by taking you on the most detailed tour of the PAPI you will find anywhere. As a live example, a component that reveals the structure of your MCMS site is created, taking you through how to manage the common elements of MCMS programmatically. \nGetting SharePoint and MCMS to work together is the next stop in the book. You will see how to use SharePoint's search engine to search MCMS content, publish content between the two systems, and create SharePoint Web Parts to draw content from MCMS.\nTo ease your everyday work with MCMS, there are chapters on placeholder validation, and some useful custom placeholders for common MCMS tasks, such as a date-time picker, a placeholder for multiple attachments, and a DataGrid placeholder among others.  \nThere are a number of ways to consume MCMS content from the outside world, and we look at two exciting ways here; RSS and InfoPath/Web Services. The InfoPath solution provides another interface to MCMS content that allows content authors to concentrate on content and not the presentation. \nThe book is rounded off with a number of must-have MCMS tips and tricks.\n\r\r\n\n\r\r\n\nRevert a posting to a previous version \n\r\r\n\nChange a postings template \n\r\r\n\nBuild a recycle bin \n\r\r\n\nDeal with links to deleted resources \n\r\r\n\nUpdate a postings properties directly from a template file \n\r\r\n\nRe-write ugly URLs to friendly URLs \n\r\r\n\nExport resource gallery items using the site deployment API (SDAPI) \n\r\r\n\nConfigure the position and size of the Web Author Console Dialogs \n\r\r\n\nGet frames and IFrames to work correctly in a template file \n\r\r\n", "isbn": "1904811531", "title": "Advanced Microsoft Content Management Server Development", "price_gbp": 37, "audience": "This book is written for developers who want to the skills to fully exploit the power of MCMS and SPS. The book presumes a working knowledge of MCMS, the .NET Framework and familiarity with the C# language. All the code examples are in C#.", "authors": ["Andrew Connell", "Angus Logan", "Lim Mei Ying", "Stefan Goßner"], "subtitle": "Working with the Publishing API, Placeholders, Search, Web Services, RSS, and Sharepoint Integration", "topics": ["Web Development", "Microsoft", "Enterprise", "Content Management (CMS)", "Microsoft Servers", "CMS and eCommerce", "All Books"], "publication date": "2005-11-16"}
{"index": {"_id":"11"}}
{"detailed description": "PHP-Nuke is a free tool for managing the content of a dynamic website. As one of the most popular applications on the Internet, PHP-Nuke has grown into a complex, powerful tool with an extraordinary range of features, and a loyal community of supporters. Through a web-based interface, users can edit and manage their site without the need for knowledge of web programming. PHP-Nuke is ideal for running a community-driven website, where visitors create accounts, comment and interact with the site, and contribute material in an easily managed fashion. PHP-Nuke has many of the features you would want from a website such as news stories, ratings, comments, discussion forums, and its look can be easily controlled with the use of themes.\n\r\r\n\nIf you want to create a powerful, fully-featured website in no time, this book is for you. This book will help you explore PHP-Nuke, putting you in the picture of what it offers, and how to go about realizing this.\n\r\r\n\nThroughout the book we develop an example site, as you are taken on a detailed tour of the features of PHP-Nuke. You will be introduced to the main components of PHP-Nuke, and learn how to manage them. You will develop the skills and confidence to manage all types of content on the site, and also understand how users work and interact with the site.\n\r\r\n\nTo make sure that you create a site that looks the way you want it to, the book covers customizing themes to help define your look for your pages. \n\r\r\n\nAlthough PHP-Nuke allows you to accomplish much without doing any web programming, to extend your site you will need to get your hands dirty with some coding. The book leads you through adding custom code to PHP-Nuke, and shows you how PHP-Nuke puts pages together, and the functions it uses for the fundamental operations of the site.", "isbn": "1904811051", "title": "Building Websites with PHP-Nuke", "price_gbp": 23, "audience": "This book is written to help you create a fully-featured website as quickly as possible. Basic knowledge of HTML will help if you intend to explore customizing your own theme, and a basic knowledge of PHP will help if you want to get the most from the chapters on extending PHP-Nuke.", "authors": ["Douglas Paterson"], "subtitle": "NULL", "topics": ["Open Source", "Content Management (CMS)", "All Books", "Web Development"], "publication date": "2005-11-25"}
{"index": {"_id":"12"}}
{"detailed description": "The book can be read from front to back, but each chapter is self contained so the reader can skip chapters to read those that they are interested in. Each chapter will move from basic to advanced where applicable and also relate what the administrator (reader) is doing to how this affects what the client sees on the site.\n\r\r\n\nSo, for example, the customization chapter will start off with a discussion on the concept of design and how to relate this to your business. Once the reader has a clear idea of what they need to do, we look at some really simple changes such as modifying the site's language, before moving to some advanced modifications which may involve some PHP programming. At the same time the discussion will demonstrate how the changes made affect the site.\n\r\r\n\nThroughout the book, much consideration is given to the \"right\" way to doing things. Readers will have the great advantage that they begin, from the very start, doing things properly. This will save them a lot of time and effort in the years to come as they build on and modify their site. Utilizing best practices and sound methodologies is a great asset for beginners and experienced users alike.\n\r\r\n\nAt all times, the coverage given in this book pays homage to the fact that, ultimately, the reader has a business goal in mind. To this end, the material never gets bogged down in technical issues or long discourses, but rather focuses on what is practically important for the online business and then moves on. To complement this, there are plenty of suggestions and hints as to how and where to look for further information.", "isbn": "1904811140", "title": "Building Online Stores with osCommerce: Professional Edition", "price_gbp": 34, "audience": "This book is written for anyone who:\n\r\r\n\n \n\r\r\n\n\r\r\n\nAlready uses OSCommerce\n\r\r\n\nWould like to use OSCommerce\n\r\r\n\nWould like to make a website for their business\n\r\r\n\nIs charged with administering, running and maintaining an OSCommerce site\n\r\r\n\nIs interested in learning how an eCommerce application is created and maintained\n\r\r\n\n\r\r\n\n ", "authors": ["David Mercer"], "subtitle": "NULL", "topics": ["Open Source", "CMS and eCommerce", "e-Commerce", "All Books"], "publication date": "2005-12-05"}
{"index": {"_id":"13"}}
{"detailed description": "Web services provide the basic technical platform required for application interoperability. They do not, however, provide higher level control, such as which web services need to be invoked, which operations should be called and in what sequence. Nor do they provide ways to describe the semantics of interfaces, the workflows, or e-business processes. BPEL is the missing link to assemble and integrate web services into a real business process BPEL4WS standardizes process automation between web services. This applies both within the enterprise, where BPEL4WS is used to integrate previously isolated systems, and between enterprises, where BPEL4WS enables easier and more effective integration with business partners. In providing a standard descriptive structure BPEL4WS enables enterprises to define their business processes during the design phase. Wider business benefits can flow from this through business process optimization, reengineering, and the selection of most appropriate processes . Supported by major vendors — including BEA, Hewlett-Packard, IBM, Microsoft, Novell, Oracle, SAP, Sun, and others — BPEL4WS is becoming the accepted standard for business process management.\n\r\r\n\nThis book provides detailed coverage of BPEL4WS, its syntax, and where, and how, it is used. It begins with an overview of web services, showing both the foundation of, and need for, BPEL. The web services orchestration stack is explained, including standards such as WS-Security, WS-Coordination, WS-Transaction, WS-Addressing, and others. The BPEL language itself is explained in detail, with Code snippets and complete examples illustrating both its syntax and typical construction. Having covered BPEL itself, the book then goes on to show BPEL is used in context. by providing an overview of major BPEL4WS servers. It covers the Oracle BPEL Process Manager and Microsoft BizTalk Server 2004 in detail, and shows how to write BPEL4WS solutions using these servers.", "isbn": "1904811817", "title": "Business Process Execution Language for Web Services 2nd Edition", "price_gbp": 53, "audience": "This book is aimed at architects and developers in the design, implementation, and integration phases of advanced information systems and e-business solutions, developing business processes and dealing with the issues of composition, orchestration, transactions, coordination, and security. The book presumes knowledge of XML and web services, web services development (either on J2EE or .NET), and multi-tier architecture\n\r\r\n\n \n\r\r\n\nBuy this book with \nBPEL Cookbook: Best Practices for SOA-based integration and composite applications development\n and get an amazing 25% off on your order!!!\n\r\r\n\n ", "authors": ["Poornachandra Sarang", "Matjaz B. Juric", "Benny Mathew"], "subtitle": "An Architects and Developers Guide to BPEL and BPEL4WS", "topics": ["Enterprise", "Oracle", "Oracle Fusion Middleware", "BPEL", "All Books", "Web Services", "Enterprise Products and Platforms"], "publication date": "2006-01-08"}
{"index": {"_id":"14"}}
{"detailed description": "Using an easy-to-read and engaging style, this book introduces the fundamentals of osCommerce, and helps you build your first online store. It covers the out-of-the-box features of osCommerce, but it also shows you how to customize the application to your own needs.\n \n The book starts with the basics of downloading and installing osCommerce, or simply how to enable it on your Internet domain using the tools provided by your host. All of the most important configuration issues are explained, with clear instructions and advice to help you make the right choices.\n\r\r\n\nOnce osCommerce is installed and configured, you will take a good look at how to work with your store's data including product information as well as other data which is responsible for keeping your site healthy.\n\r\r\n\nThe all important topic of customization is also dealt with comprehensively. You will see how to develop attractive sites that will make your store a pleasure to browse and your products a pleasure to buy!\n\r\r\n\nOf course, no discussion on osCommerce would be complete without a look at how to obtain and treat payments. Using the modules provided with osCommerce you will be collecting money from your happy customers in no time!\n\r\r\n\nOnce the reader has a fully fledged, and operational site it is time to look at deployment  an important topic for discussion if development has taken place on a development machine.\n\r\r\n\nThe appendix will add a few tools to your armory and shed some light as to what is going on behind the scenes in case things go awry.", "isbn": "1904811884", "title": "Building Online Stores with osCommerce: Beginner Edition", "price_gbp": 23, "audience": "This book is written for:\n\r\r\n\n\r\r\n\nfirst time users of osCommerce\n\r\r\n\ncurrent osCommerce who would like to further customize their websites\n\r\r\n\nanyone who would like to quickly build a website for their online business\n\r\r\n", "authors": ["David Mercer"], "subtitle": "NULL", "topics": ["Open Source", "e-Commerce", "All Books", "CMS and eCommerce"], "publication date": "2006-01-25"}
{"index": {"_id":"15"}}
{"detailed description": "SugarCRM is a popular customer relationship management system. It is available in both free open source and commercial versions, making it an ideal way for small-medium business to try out a CRM system without committing large sums of money. Although SugarCRM is carefully designed for ease of use, attaining measurable business gains requires careful planning and research. This book distils hard won SugarCRM experienced into an easy to follow guide to implementing the full power of SugarCRM. SugarCRM is an extensive PHP/MySQL based application but with its rich administration interfaces no programming is required to get the most of it.\n\r\r\n\nThis book will give you all the information you need to start using this powerful, free CRM system.\n Written by  veteran SugarCRM expert and experienced documentation author, Michael J. Whitehead, this book is the definitive guide to implementing SugarCRM. Whether you are wondering exactly what benefits CRM can bring, or you have already learned about CRM systems but have yet to implement one, or you're working with SugarCRM already; this book will show you how to get maximum benefit of this exciting product.", "isbn": "190481168X", "title": "Implementing SugarCRM", "price_gbp": 46, "audience": "\r\r\n\n Small-medium business owners/managers with reasonable IT skills, who want to implement SugarCRM for themselves as either a first CRM or as a replacement for existing solutions.\n\r\r\n\n IT staff tasked with implementing, maintaining, or upgrading a SugarCRM installation\n\r\r\n\n Existing SugarCRM users who want to broaden their understanding of the topic\n\r\r\n\n No programming knowledge is required to use this book to implement, customise and use SugarCRM\n\r\r\n", "authors": ["Michael Whitehead"], "subtitle": "NULL", "topics": ["Open Source", "CRM", "Content Management (CMS)", "All Books", "CMS and eCommerce"], "publication date": "2006-02-24"}
{"index": {"_id":"16"}}
{"detailed description": "Joomla! is a fully featured web content management system and was created in Summer 2005 as a fork from the hugely popular Mambo CMS with many of the original Mambo developers moving their efforts to Joomla! While still in its first release, it is supported by an active and well organized open source development team and community. Joomla! is both easy to use at the entry level for creating basic websites, whilst having the power and flexibility to support complex web applications. Joomla! implements the core requirements of a full-featured CMS. It has a powerful and extensible templating system with the ability to upload and manage many different data types. User access control, content approval, rich administrative control, and content display scheduling are all built-in. New features and extensions are constantly added to the core system, with many more being available and supported by the community", "isbn": "1904811949", "title": "Building Websites with Joomla! v1.0", "price_gbp": 34, "audience": "This book is suitable for web developers, designers, webmasters, content editors and marketing professionals who want develop a fully featured web presence in a simple and straightforward process. It does not require any detailed knowledge of programming or web development, and any IT confident individual will be able to use the book to produce an impressive web site.", "authors": ["Hagen Graf"], "subtitle": "NULL", "topics": ["Open Source", "Content Management (CMS)", "All Books", "Joomla!", "CMS and eCommerce"], "publication date": "2006-03-01"}
{"index": {"_id":"17"}}
{"detailed description": "Assuming a basic knowledge of PHP, XML, JavaScript and MySQL, this book will help you understand how the heart of AJAX beats and how the constituent technologies work together. After teaching the foundations, the book will walk you through numerous real-world case studies covering tasks youâ€™ll be likely to need for your own applications:\n\r\r\n\n\r\r\n\nServer-enabled form-validation page \n\r\r\n\nOnline chat collaboration tool \n\r\r\n\nCustomized type-ahead text entry solution \n\r\r\n\nReal-time charting using SVG \n\r\r\n\nDatabase-enabled, editable and customizable data grid \n\r\r\n\nRSS aggregator application \n\r\r\n\nA server-managed sortable list with drag&drop support using the script.aculo.us JavaScript toolkit \n\r\r\n\n\r\r\n\nThe appendices guide you through installing your working environment, using powerful tools that enable debugging, improving, and profiling your code, working with XSLT and XPath.\n\r\r\n\n\r\r\n\n\r\r\n\nFrom the Author, Cristian Darie\n\"AJAX and PHP: Building Responsive Web Applications is mainly a book for beginners, but when designing its contents we tried to find the ideal blend of topics that would help both novice and experienced web developers make a big step forward. One customer was very kind to let us know, through a review, that we succeeded:\n\r\r\n\n\"The theory behind all the technologies used is very clearly explained, without boring you with details about obvious things. Right from the first chapter you start learning by examples. The examples can be easily adapted to many web projects and they cover stuff that is both useful and fun.\"\n\r\r\n\nHere are a few examples of such \"useful and fun\" things that you can find in this book:\n\r\r\n\n \n\r\r\n\n\r\r\n\ndetails on using proxy scripts to work around the security measures in modern browsers\n\r\r\n\nclient-side and server-side code that doesn't break when fed with special characters (such as \<, \", etc)\n\r\r\n\ncode that works efficiently with Internet Explorer 5, 6 and 7, Firefox, Opera, Safari, and others\n\r\r\n\na very quick introduction to SVG, the new rebel kid of the web (and of the house)\n\r\r\n\nclient-server communication based on message queues that guarantee that your messages aren't lost on the way, and arrive in the intended order at the destination\n\r\r\n\nserver-side state management techniques that use query string parameters and database records to keep track of your client's activity\n\r\r\n\nsimple yet effective error-handling structures that combine JavaScript code and PHP code to report when something bad happens on the client or on the server\n\r\r\n\na live errata page that is updated as soon as anyone reports a suggestion or a correction\n\r\r\n\na friendly AJAX tutorial and many case studies that teach you how to use JavaScript, PHP, MySQL and XML together in order to achieve wonderful results\n\r\r\n\n\r\r\n\nThe book's authors and the publisher are listening to your feedback, and appreciate when you invest some time to let them know what you think. The first result of this collaboration is an updated version of the AJAX Chat case study that uses (and teaches) JSON instead of XML. Find this new chapter in the code download or on my website.\n\r\r\n\nThanks for reading such a long message. Have fun!\" Cristian Darie.", "isbn": "1904811825", "title": "AJAX and PHP: Building Responsive Web Applications", "price_gbp": 22, "audience": "This book is for web developers willing to build better web applications. A basic knowledge of PHP, XML, JavaScript and MySQL, or a strong will to learn-as-you-type, is assumed.\n\r\r\n\n ", "authors": ["Mihai Bucica", "Filip Cherecheş-Toşa", "Cristian Darie", "Bogdan Brinzarea"], "subtitle": "NULL", "topics": ["Web Development", "PHP", "Open Source", "AJAX", "Web Development", "All Books"], "publication date": "2006-03-10"}
{"index": {"_id":"18"}}
{"detailed description": "\"A great book for getting the most out of your cPanel-supporting web host\"\n \n If you have web hosting requirements beyond the most basic, you should look for a host that offers cPanel. cPanel gives you tight control over every aspect of your web site, email accounts, and domain names. \n \n But once you've got a web site with cPanel support, how do you go about using it? While the documentation  included with cPanel may provide a quick reference, to really get the most from it you need a more detailed, systematic tutorial.\n \n Read this book to find out exactly how to get the most from cPanel in all aspects of your web site management: web, email, FTP, security, domains, back ups, and more.", "isbn": "1904811922", "title": "cPanel User Guide and Tutorial", "price_gbp": 23, "audience": "Anybody who has a web hosting account that provides  cPanel, and who wants to get the most from this very powerful tool.", "authors": ["Aric Pedersen"], "subtitle": "Get the most from cPanel with this easy to follow guide", "topics": ["Linux Servers", "Web Development", "All Books"], "publication date": "2006-03-24"}
{"index": {"_id":"19"}}
{"detailed description": "The Domain Name System is one of the foundations of the internet. It is the system that allows the translation of human-readable domain names into machines-readable IP addresses and the reverse translation of IP addresses into domain names. This book describes the basic DNS protocol and its extensions; DNS delegation and registration, including for reverse domains; using DNS servers in networks that are not connected to the internet; and using DNS servers on firewall machines. Many detailed examples are used throughout the book to show perform various configuration and administration tasks.", "isbn": "1904811787", "title": "DNS in Action", "price_gbp": 23, "audience": "This book is for system administrators and network architects who need to learn how to run and configure DNS servers. A working knowledge of TCP/IP protocols is presumed.", "authors": ["Alena Kabelová", "Libor Dostálek"], "subtitle": "A detailed and practical guide to DNS implementation, configuration, and administration", "topics": ["Networking & Telephony", "Architecture & Analysis", "All Books", "Networking and Servers"], "publication date": "2006-04-05"}
{"index": {"_id":"20"}}
{"detailed description": "Drupal is one of the most popular content management systems on the internet. Based on PHP/MySQL, its power and flexibility combined with its exceptional design mean it is already on the way to becoming the de facto standard for CMS Websites. Drupalâ€™s modular design and structured source code make it both highly flexible and easily extended and modified. Drupal is extremely scalable, making it ideal for both a simple personal website as well as an industrial strength commercial or institutional web presence.\n \n Drupal is a model open source project in that it has a large, friendly community of people who contribute to the project in various ways.  Drupal is not only free and easy to use, but this community provides on going mutual support.\n \n Drupalâ€™s power means choosing an initial pathway can be daunting. The flexibility and power of its content management features mean the right approach needs to be taken.  This book takes you from initial set up through site design and creation in a series of carefully structured steps. While there are a few advanced topics that are beyond the scope of the book, all of the core stages of creating a website using Drupal are covered in detail.\n\r\r\n\n ", "isbn": "1904811809", "title": "Drupal: Creating Blogs, Forums, Portals, and Community Websites", "price_gbp": 30, "audience": "This book will suit anyone who has a need to create a content rich website. Whether you are:\n\r\r\n\n\r\r\n\nAdding a personal web page \n\r\r\n\nBuilding a forum\n\r\r\n\nWriting a collaborative book\n\r\r\n\nRetailing goods\n\r\r\n\nCreating a blog \n\r\r\n\nLaunching a community Website\n\r\r\n\n\r\r\n\nThis book will prove to be an indispensable companion. Both experts and beginners to computing alike will find the information contained herein to be accessible and easy to intuit.", "authors": ["David Mercer"], "subtitle": "How to setup, configure and customise this powerful PHP/MySQL based Open Source CMS", "topics": ["Open Source", "All Books", "Drupal", "Content Management (CMS)", "CMS and eCommerce"], "publication date": "2006-05-11"}
{"index": {"_id":"21"}}
{"detailed description": "NULL", "isbn": "1904811612", "title": "Construindo Sistemas de Telefonia com o Asterisk [Portuguese]", "price_gbp": 23, "audience": "Este livro visa a todos que estejam interessados em construir um poderoso sistema de telefonia usando uma aplicação gratuita e de código livre, o Asterisk, sem a necessidade de gastar alguns milhares de dólares comprando um sistema comercial, muitas vezes bem menos flexível.\n\r\r\n\nEste livro é adequado para os iniciantes e novatos em Asterisk e telefonia. Experiência em Linux ou telefonia é bem-vinda, mas não obrigatória.\n\r\r\n", "authors": ["David Gomillion", "Dov Bigio [Trans.]", "Barrie Dempster"], "subtitle": "Uma introdução simples para o uso e a configuração do Asterisk para a construção de sistemas de telefonia completos para pequenas e medias empresa", "topics": ["Open Source", "All Books", "Portuguese, Espanol, Italiano, French", "Networking & Telephony", "Networking and Servers"], "publication date": "2006-06-20"}
{"index": {"_id":"22"}}
{"detailed description": "The book is packed with interesting and fun examples. We had a lot of fun coming up with cool ways to demonstrate ImageMagick's power, and we're sure you'll have fun learning how to create them.\nAlthough the printed book is in black and white, there is a full colour PDF of the screenshots freely available that includes all of the images in the book. Use it to see exactly what the ImageMagick effects look like in colour, or browse through it and see just what you'll learn to do with this book.\nImageMagick is a free software suite to create, edit, and compose bitmap images using text-based commands. The commands can be issued from the command line, but more often will be included in web or desktop applications â€“ carrying out complex image-manipulation tasks in response to the user's input.\nImageMagick is a popular way for generating images on-the-fly in web pages, whether it's generating thumbnails from a large image, or creating complex combinations of images, text, and effects chosen by a visitor or the web site's creator.", "isbn": "1904811868", "title": "ImageMagick Tricks", "price_gbp": 26, "audience": "NULL", "authors": ["Sohail Salehi"], "subtitle": "Web Image Effects from the Command Line and PHP", "topics": ["Web Graphics & Video", "Open Source", "Other", "All Books"], "publication date": "2006-06-24"}
{"index": {"_id":"23"}}
{"detailed description": "NULL", "isbn": "1904811604", "title": "GDI+ Application Custom Controls with Visual C# 2005", "price_gbp": 28, "audience": "This book has been written with the intermediate C# developer in mind. Assuming a working knowledge of C#, the book teaches you how to implement custom controls using Visual C# 2005 Express Edition and all other versions of Visual C#, and GDI+ with .NET 2.0", "authors": ["Tiberiu Radu", "Iulian Serban", "Dragos Brezoi", "Adam Ward"], "subtitle": "NULL", "topics": ["Microsoft", "Enterprise", "Microsoft Other", "All Books", "Application Development"], "publication date": "2006-07-10"}
{"index": {"_id":"24"}}
{"detailed description": "Service Oriented Architecture is generating a buzz across the whole IT industry. Propelled by standards-based technologies like XML, Web Services, and SOAP, SOA is quickly moving from pilot projects to mainstream applications critical to business operations. One of the key standards accelerating the adoption of SOA is Business Process Execution Language for Web Services (BPEL). \nBPEL was created to enable effective composition of web services in a service-oriented environment. In the past two years, BPEL has become the most significant standard to elevate the visibility of SOA from IT to business level. BPEL is not only commoditizing the integration market, but it is also offering organizations a whole new level of agility â€“ ability to rapidly change applications in response to the changing business landscape. BPEL enables organizations to automate their business processes by orchestrating services within and across the firewall. It forces organizations to think in terms of services. Existing functionality is exposed as services. New applications are composed using services. Communication with external vendors and partners is through services. Services are reused across different applications. Services are, or should be, everywhere!", "isbn": "1904811337", "title": "BPEL Cookbook: Best Practices for SOA-based integration and composite applications development", "price_gbp": 34, "audience": "This book is aimed at architects and developers building applications in Service Oriented Architecture. The book presumes knowledge of BPEL, SOA, XML, web services, and multi-tier architectures.\n\r\r\n\nBook Editors\n\r\r\n\nMarkus Zirn\nMarkus Zirn is a Senior Director of Product Management for Oracle Fusion Middleware. In this role he heads the Strategic Customer Program, where he works with Oracle's leading and most innovative middleware customers. He has been part of the Enterprise Software industry for more than 10 years, including roles as Vice President of Product Marketing and part of the founding team of QUIQ and as a Management Consultant of Booz Allen & Hamilton's Silicon Valley High Tech Practice. Markus' passion for Service-Oriented Architecture (SOA) and BPEL stems both from practical experience designing and optimizing business processes as part of process reengineering projects and from being part of the advent of \"software as a service\" before web services became mainstream. He holds a Masters of Electrical Engineering from the University of Karlsruhe and is an alumnus of the Tripartite program, a joint European degree from the University of Karlsruhe, Germany, the University of Southampton, UK, and ESIEE, France.\n\r\r\n\nHarish Gaur\nHarish Gaur has more than 10 years of experience in the enterprise software industry. He is currently the Group Product Manager for Fusion Middleware at Oracle. In his current role, he works closely with strategic customers implementing Service-Oriented Architecture using Oracle SOA technology. Harish's expertise in Service-Oriented Architecture (SOA) draws from an extensive hands-on experience with Business Process Management (BPM) and Enterprise Application Integration (EAI).\n\r\r\n\nBefore Oracle, he worked as a Solution Specialist with Vitria Technology educating customers about the benefits of Business Process Management. Prior to that, he helped Fortune 500 companies architect scalable integration solutions using EAI tools like webMethods and CrossWorlds (now IBM). Harish holds an engineering degree in Computer Science and is an MBA from Haas School of Business, UC Berkeley. He lives in Fremont, CA with his wife Swati and son Agastya.\n\r\r\n\nBuy this book with \nBusiness Process Execution Language for Web Services 2nd Edition\n and get an amazing 25% off on your order!", "authors": ["Yves Coene", "The Hoa Nguyen", "Stany Blanvalet", "Sean Carey", "Praveen Ramachandran", "Michael Cardella", "Matjaz B. Juric", "Markus Zirn", "Lawrence Pravin", "Kevin Geminiuc", "Jerry Thomas", "Jeremy Bolie", "Harish Gaur", "Doug Todd", "Arun Poduval"], "subtitle": "NULL", "topics": ["Web Services", "All Books", "Oracle", "BPEL", "Architecture & Analysis", "SOA", "Enterprise", "Oracle Fusion Middleware", "Enterprise Products and Platforms"], "publication date": "2006-07-23"}
{"index": {"_id":"25"}}
{"detailed description": "The release of Microsoft Content Management Server (MCMS) Service Pack 2 opens up the world of ASP.NET 2.0 to MCMS developers. Written by the masters of MCMS, this book shows you how to use the new features of ASP.NET 2.0 that everyone is talking about in your MCMS development.\nYou will first learn how to install and configure MCMS SP2. There are two approaches to setting up a development environment for SP2: an upgrade from a previous SP1a installation or starting from scratch and building a fresh installation including SP2. Of course, both approaches are covered.\nYou will become familiar with the MCMS Service Pack 2 development environment, and create custom Visual Studio 2005 templates to overcome some of the issues which are present with the templates shipped with MCMS SP2.\nAfter that, its time to look at some of the most exciting features of ASP.NET 2.0, and how you can make use of them in MCMS: master pages, site navigation, themes, and the membership provider model.\nOne of the coolest features introduced with ASP.NET 2.0 is master pages, which allow developers to enforce common layout and behaviour across pages within an application. You will learn about the benefits of using master pages and see a step-by-step guide for implementing them in your MCMS applications, where they become master templates!\nASP.NET 2.0 introduces a whole new way of implementing site navigation, driven by site maps. By programmatically adding channels and postings to a site map you will see how to smoothly integrate these controls to any MCMS site.\nTo customize the look of your site, we will see how a common look and feel can be applied efficiently to a MCMS site by using ASP.NET 2.0 themes. An essential customization required for themes to work correctly in an MCMS site is a must-read feature of this chapter.\nMCMS has its own role based authorization and user management system which cannot be extended. However, the new ASP.NET 2.0 Membership Provider Model and the shipped controls can be used within MCMS applications to improve the implementation of Forms Authentication and provide a more elegant solution for authenticating against an external store.\nA collection of tips and tricks round off the book, including using the Provider Model design pattern to ease migration to Office SharePoint Portal Server", "isbn": "1904811523", "title": "Enhancing Microsoft Content Management Server with ASP.NET 2.0", "price_gbp": 29, "audience": "The book is written for developers who work with Microsoft Content Management Server, and want to update their skills to take advantage of the latest offerings in ASP.NET. If you are an MCMS developer who hasn't yet got into ASP.NET 2.0, this book is an ideal introduction to the most exciting features of ASP.NET 2.0, and how you can make them work for you.", "authors": ["Lim Mei Ying", "Spencer Harbar", "Stefan Goßner"], "subtitle": "ASP.NET 2.0 Master Pages, Themes, Site Navigation, and the Membership Provider Model in Microsoft Content Management Server Development", "topics": [".NET", "Microsoft Development ", "Microsoft", "Content Management (CMS)", "Enterprise", "All Books", "Web Development", "Web Development"], "publication date": "2006-08-04"}
{"index": {"_id":"26"}}
{"detailed description": "IPCop is a powerful, open source, Linux based firewall distribution for primarily Small Office Or Home (SOHO) networks, although it can be used in larger networks. It provides most of the features that you would expect a modern firewall to have, and what is most important is that it sets this all up for you in a highly automated and simplified way.\nThis book is an easy introduction to this popular application. After introducing and explaining the foundations of firewalling and networking and why they're important, the book moves on to cover using IPCop, from installing it, through configuring it, to more advanced features, such as configuring IPCop to work as an IDS, VPN and using it for bandwidth management. While providing necessary theoretical background, the book takes a practical approach, presenting sample configurations for home users, small businesses, and large businesses. The book contains plenty of illustrative examples.", "isbn": "1904811361", "title": "Configuring IPCop Firewalls: Closing Borders with Open Source", "price_gbp": 30, "audience": "Anyone interested in securing their networks with IPCop â€” from those new to networking and firewalls, to networking and IT Professionals with previous experience of IPCop. No knowledge of Linux or IPCop is required. ", "authors": ["Barrie Dempster", "James Eaton-Lee"], "subtitle": "How to setup, configure and manage your Linux firewall, web proxy, DHCP, DNS, time server, and VPN with this powerful Open Source solution", "topics": ["Networking & Telephony", "All Books", "Linux Servers", "Security and Testing", "Open Source", "Networking and Servers"], "publication date": "2006-10-01"}
{"index": {"_id":"27"}}
{"detailed description": "osCommerce has been around since March 2000. At present there are over 10,000 live, registered osCommerce sites, and about 100,000 registered community members. Apart from providing ready-made solutions to problems, as well as a huge repository of information, the osCommerce community is a living entity with which we can all interact. With the rising success and popularity of this remarkable piece of software, things can only get better.", "isbn": "1847190901", "title": "Deep Inside osCommerce: The Cookbook", "price_gbp": 37, "audience": "This book is for people who are already familiar with osCommerce. It presumes a working knowledge of PHP and HTML, as well as basic understanding of phpMyAdmin for database inserts.", "authors": ["Monika Mathé"], "subtitle": "NULL", "topics": ["Open Source", "e-Commerce", "Content Management (CMS)", "Cookbooks", "All Books", "CMS and eCommerce"], "publication date": "2006-10-01"}
{"index": {"_id":"28"}}
{"detailed description": "DotNetNuke is an open-source Content Management System and web application framework. DotNetNuke has taken the Microsoft world by storm and now at version 4, its community has grown to over 200,000 users.\nThis book covers virtually everything you need to know to get your DotNetNuke website up and running. Concisely written and with clear explanations, this book is covers installation, administration, deployment, site creation and all of the basic built in DotNetNuke modules. For developers, chapters on the core architecture, skinning and custom modules, including coverage of the DAL+, give you the skills to customize and extend your site.\nThe book starts off by giving you a deep understanding of working with basic DotNetNuke sites, guiding you through the features and giving you the confidence to create and manage your site. \nAfter that, you will journey to the heart of DotNetNuke, and learn about its core architecture. Always concise, relevant and practical, you will find out what makes DotNetNuke tick, and from there, you will be ready to customize DotNetNuke. Developers will enjoy the detailed walkthrough of creating a new custom modules. Special emphasis is given to the DAL+, an extended feature set of the DotNetNuke Data Access Layer (DAL). You will see how to create custom modules with the DAL+, and invigorate your module development.\nWeb designers will enjoy the material on skinning, helping them to create a new look for their site. You will learn about creating new skins, and packaging them up for easy deployment.\nYou will master all of this as you leap into the development of a DotNetNuke 4 site.", "isbn": "190481199X", "title": "Building Websites with VB.NET and DotNetNuke 4", "price_gbp": 30, "audience": "This book has been written for both the  beginner wanting to set up a website and also ASP.NET developers with a grasp of  VB.NET who want a deeper understanding of how to work with DotNetNuke. To work  with the DotNetNuke code, you will need access to Visual Web Developer Express  or Visual Studio .NET 2005. No prior knowledge of DotNetNuke is  assumed.", "authors": ["Steve Valenzuela", "Michael Washington", "Daniel N. Egan"], "subtitle": "NULL", "topics": ["Microsoft", "All Books", "Microsoft Development ", ".NET", "Content Management (CMS)", "DotNetNuke", "Web Development"], "publication date": "2006-10-09"}
{"index": {"_id":"29"}}
{"detailed description": "Asterisk Ã¨ un framework open source potente e flessibile per costruire sistemi telefonici ricchi di funzionalitÃ . Come un centralino PBX che connette uno o piÃ¹ telefoni, e normalmente connette uno o piÃ¹ linee, Asterisk offre caratteristiche molto avanzate, includendo chiamate punto-punto, line trunking, distribuzione delle chiamate, registrazione del dettaglio della chiamata e registrazione della chiamata.\nAsterisk puÃ² essere usato per fornire sistemi Interactive Voice Response (IVR). La potenza e la flessibilitÃ  do un sistema telefonico programmabile ci dÃ  la possibilitÃ  di rispondere in modi significativi ai nostri clienti. \nAsterisk ha incluso un sistema completamente funzionate di voicemail. Supporta contesti di voicemail cosicchÃ© organizzazioni diverse possano essere ospitate sullo stesso server. Supporta  differenti fusi orari cosicchÃ© gli utenti possano tener traccia quando le loro chiamate arrivano. Fornisce persino lâ€™opzione di segnalare il destinatario di un nuovo messaggio via email. In effetti, possiamo persino allegare il messaggio audio!\nAlla fine, Asterisk Ã¨ un sistema Voice Over IP (VoIP). I benefici del VoIP sono numerosi. Per esempio, possiamo avere molteplici utenti usando lo stesso servizio Asterisk da una varietÃ  di posti; possiamo avere utenti nellâ€™ufficio locale che usano telefoni PSTN o telefoni IP; possiamo aver utenti VoIP remoti; possiamo persino aver interi sistemi Asterisk che oprano e lavorano separatamente ma con instradamento integrato. Possiamo avere un interno ovunque abbiamo una connessione Internet ragionevolmente veloce, che significa che gli impiegati possono avere un interno sul loro sistema telefonico a casa se hanno una connessione a banda larga. I benefici sono troppi da elencare.\nFlessibilitÃ  significa spesso complessitÃ , e questo Ã¨ vero nel caso di Asterisk. Questo libro Ã¨ tutto ciÃ² che avete bisogno per capire e usare Asterisk per costruire sistemi telefonici che incotrino i vostri bisogni. Imparerete come usare le molte caratteristiche che Asterisk vi fornisce. \nDavid Gomillion Ã¨ il Direttore della Information Technology per Eye Center della North Florida.  LÃ , si occupa di tutta la parte tecnologica di questo  studio medico con quattro sedi, inclusi i computer, il software ( pronto allâ€™uso e sviluppato ad hoc), i sistemi, la telefonia, la rete,  cosÃ¬ come i sistemi per la diagnositica specializzata e il trattamento.\nDavid ha ricevuto una laurea in Computer Science dalla Brigham Young University nellâ€™agosto del  2005.  Qui ha studiato la teoria dietro la sua esperienza informatica, ed Ã¨ diventato un programmatore molto piÃ¹ efficiente.\nDavid ha lavorato attivamente nel settore della Information Technology fin dal quando era matricola alla BYU.  Eâ€™ stato un assisatente al rete, un amministratore assistente alla rete, un supervisore per large Network e Server Operations unit, un amministratore di rete, ed infine un direttore del Information Technology.\nAttraverso le sue crescenti responsabilitÃ , ha imparato come rendere prioritari bisogni e desideri, e applicare questa abilitÃ  per la sue installazioni di Asterisk. \nBarrie Dempster era amministratore di rete e responsabile IT per un call center in crescita quando ha visto la convergenza e la dipendenza fra la  telefonia e i campi legati al campo IT. Si Ã¨ focalizzato sullâ€™integrazione della telefonia con lâ€™infrastruttura IT, e ha scelto al sicurezza come professione. Lâ€™aumento delle comunicazioni voice over IP ha portato ora ad un alta richiesta per queste capacitÃ , che ora utilizza nel suo attuale impiego come consulente per lâ€™infrastruttura e la sicurezza in Scozia per una varietÃ  di clienti principalmente nel settore finanziario. \nEâ€™ coinvolto in vari progetti, dalla costruzione e sviluppo di server web e database alla creazione di sistemi personalizzati di comunicazione e conferenza,la maggior parte dei quali sono altamente sicuri per sopravvive alle reti pubbliche. Ha sviluppato e usato una varietÃ   di sistemi PBX e, in quanto grande supporter e utente di software gratuito e open source ,  ha un serio interesse per Asterisk poichÃ© combina tutti questi interessi in un pacchetto unico estremamente potente.", "isbn": "1904811965", "title": "Costruire Sistemi Telefonici con Asterisk [Italiano]", "price_gbp": 23, "audience": "Questo libro Ã¨ rivolto a chiunque sia interessato a costruire sistemi telefonici potenti usando lâ€™applicazione gratuita e opens source, Asterisk, senza spendere molte migliaia di euro per comprare un sistema commerciale e spesso meno flessibile.\nQuesto libro Ã¨ adatto a principianti e coloro che sono nuovi ad Asterisk e alla telefonia. Esperienza con la Telefonia o Linux saranno utili, ma non richiesti.", "authors": ["David Gomillion", "Barrie Dempster"], "subtitle": "Questo libro presenta inoltre delle configurazione di esempio per usare Asterisk in tre differenti scenari: per piccolo uffici, piccolo aziende , e grandi PBX.", "topics": ["All Books", "Portuguese, Espanol, Italiano, French", "Networking and Servers"], "publication date": "2006-10-16"}
{"index": {"_id":"30"}}
{"detailed description": "XOOPS is an open source web content management system, written in PHP. It allows administrators to easily create dynamic websites with great content and many outstanding features. It is an ideal tool for developing small to large dynamic community websites, intra company portals, corporate portals, weblogs and much more. It has a large, enthusiastic, and helpful community of users.\nIf you want to create a powerful, fully-featured website in no time, this book is for you. This book will help you explore XOOPS, putting you in the picture of what it offers, and how to go about building a site with the system.\nYou will be introduced to the main components of XOOPS, and learn how to manage them. You will develop the skills and confidence to manage all types of content on the site, and also understand how users interact with the site. As you find your way round, your own ideas for what you need in your new website begin to crystallize around what you can see of the capabilities and flexibility of XOOPS.\n\r\r\n\nTo make sure that you create the site that looks the way you want, the book covers working with themes to help define your look for your pages. A case study of developing an example Intranet rounds off the book.", "isbn": "1904811280", "title": "Building Websites with XOOPS : A step-by-step tutorial", "price_gbp": 23, "audience": "This book is suitable for web developers, designers, webmasters, and marketing professionals who want develop a fully featured web presence in a simple and straightforward process using XOOPS. It does not require any detailed knowledge of programming or web development, and any IT confident individual will be able to use the book to produce an impressive web site.", "authors": ["Steve Atwal"], "subtitle": "Get your XOOPS website up fast using this easy-to-follow guide", "topics": ["Open Source", "Content Management (CMS)", "All Books", "Web Development"], "publication date": "2006-10-24"}
{"index": {"_id":"31"}}
{"detailed description": "Firewalls are used to protect your network from the outside world. Using a Linux firewall, you can do a lot more than just filtering packets. This book shows you how to implement Linux firewalls and Quality of Service using practical examples from very small to very large networks.\nAfter giving us a background of network security, the book moves on to explain the basic technologies we will work with, namely netfilter, iproute2, NAT and l7-filter. These form the crux of building Linux firewalls and QOS. The later part of the book covers 5 real-world networks for which we design the security policies, build the firewall, setup the script, and verify our installation. \nProviding only necessary theoretical background, the book takes a practical approach, presenting case studies and plenty of illustrative examples.", "isbn": "1904811655", "title": "Designing and Implementing Linux Firewalls and QoS using netfilter, iproute2, NAT and l7-filter", "price_gbp": 30, "audience": "This book is aimed at Linux Network administrators\n<!--[if !supportAnnotations]-->\n \nwith some understanding of Linux security threats and issues, or any one interested in securing their systems behind a firewall. Basic knowledge of Linux is presumed but other than that this book shows you how to do the rest, from configuring your system to dealing with security breaches.", "authors": ["Lucian Gheorghe"], "subtitle": "Learn how to secure your system and implement QoS using real-world scenarios for networks of all sizes", "topics": ["Networking & Telephony", "Linux Servers", "All Books", "Networking and Servers"], "publication date": "2006-10-31"}
{"index": {"_id":"32"}}
{"detailed description": "Community Server is Telligent System's award-winning solution for quickly and easily enabling online communities. It includes a suite of integrated applications, such as blogs, discussion forums, photo sharing, file sharing, email lists, newsgroups, and more, which together can help you create your community presence. Community Server is the trusted solution for many organizations ranging from Microsoft and Dell to Conde Nast and Match.com, and powers massive communities like the Microsoft ASP.NET forums (www.asp.net/forums) and the XBOX forums (forums.xbox.com). You can learn more about Community Server, and see it in action, at http://www.communityserver.org.\nWritten in a clear and concise manner, this book will guide you through the installation, administration, customization, and deployment of a Community Server solution. With the help of this book you will be able to start using your Community Server site within minutes of its installation. The book kicks off with a brief overview of Community Server, its various editions and licensing options, and installation procedures and then delves deep into the creation and management of blogs, forums, photo galleries, file galleries, and more. \nThe book also explores the different ways you can customize your Community Server site along with coverage of various add-ons and modules. You will also learn how to manage your Community Server license and other related settings.  Towards the end, the book provides an overview of the various steps required to deploy Community Server to a hosting server.", "isbn": "1847190871", "title": "Community Server Quickly", "price_gbp": 30, "audience": "This book is aimed at the Community Server administrator with a base level of technical competence and confidence, but no prior sysadmin or developer experience or knowledge. \nNo knowledge of ASP.NET programming is required\n for using this book. What is essential is your own passion for your target community and your desire to provide the best platform possible to that audience.", "authors": ["Anand Narayanaswamy"], "subtitle": "A Concise and Practical Guide to Installation, Administration, and Customization", "topics": ["All Books", "Microsoft", "Enterprise", "Content Management (CMS)", ".NET", "Microsoft Servers", "Open Source", "Networking and Servers"], "publication date": "2006-11-24"}
{"index": {"_id":"33"}}
{"detailed description": "For most of us, setting up the database for an application is often an afterthought. While you don't need to be a professional database designer to create a working application, knowing a few insider tips and techniques can make both the process easier and the end result much more effective. This book doesn't set out to make you an expert in data analysis, but it does provide a quick and easy way to raise your game in this essential part of getting your application right.", "isbn": "1904811302", "title": "Creating your MySQL Database: Practical Design Tips and Techniques ", "price_gbp": 16, "audience": "Anyone working with applications that use a MySQL database backend will benefit greatly from the advice and techniques in this book. Although a working knowledge of both SQL and MySQL is assumed, the book is suitable for both beginners and intermediate users alike. Whether you read it through and absorb the advice or work through it on a live project, the efficiency and maintainability of your databases will certainly improve as a result.", "authors": ["Marc Delisle"], "subtitle": "A short guide for everyone on how to structure your data and set-up your MySQL database tables efficiently and easily.", "topics": ["Oracle", "MySQL", "All Books", "Open Source", "Oracle Other", "Big Data and Business Intelligence"], "publication date": "2006-11-25"}
{"index": {"_id":"34"}}
{"detailed description": "Written by Lotus insiders, the book provides a practical guide to developing applications making use of the important features and enhancements introduced in Notes/Domino 7. These experienced experts use their own experiences to map out the benefits you could gain, and the dangers you may face, as you develop Domino applications in your business.  \n\r\r\n\nWritten by specific experts, edited and overseen by Lotus content generator Dick McCarrick, this book is the definitive guide to developing Domino 7 applications.    \n\r\r\n\nTECHNOLOGY\n \nDomino is an application server that can be used as a standalone web server or as the server component of IBM's Lotus Domino product which provides a powerful collaborative platform for development of customized business applications. It also provides enterprise-grade email, messaging, and scheduling capabilities.", "isbn": "190481106X", "title": "Domino 7 Lotus Notes Application Development", "price_gbp": 44, "audience": "Developers who work with Lotus technologies, and need to get to grips with the new developer features provided in version 7.", "authors": ["Tim Speed", "Stephen Cooke", "Raphael Savir", "Dick McCarrick"], "subtitle": "Writing and upgrading applications for the latest Lotus Notes Domino Platform", "topics": ["Enterprise", "All Books", "IBM", "Other"], "publication date": "2007-01-29"}
{"index": {"_id":"35"}}
{"detailed description": "Alfresco offers true Enterprise Content Management (ECM) and aspires to be \"Documentum fast and free\", and was founded by a former Documentum executive. Alfresco can store a wide range of digital content in flexible, smart \"spaces\". Content is accessible through a web interface, shared network folders, FTP, WebDav, and other methods.\nUsers can set up Alfresco to process content in certain ways, according to business rules and workflow requirements. It can also apply version control to documents automatically, making it easy and safe to collaborate and update documents.\nAlfresco is regarded as the most powerful open-source enterprise content management system. Using Alfresco, administrators can easily create rich, shared content repositories. This book shows you how to unleash this power to create collaborative working systems in your enterprise.", "isbn": "1904811116", "title": "Alfresco Enterprise Content Management Implementation", "price_gbp": 44, "audience": "This book is designed for system administrators, experienced users or developers who want to install and use Alfresco in their teams or businesses. Because Alfresco is free many teams can install and experiment with its ECM features without any upfront cost, often without management approval. The book assumes a degree of technical confidence but does not require specialist sysadmin or developer skills to get a basic system up and running.\nAlfresco is particularly suitable for IT consultants who want or need to set up a flexible enterprise content management system for their clients, be that for demonstration, development, or as a mission-critical platform. This book gets you to that result quickly and effectively.", "authors": ["Munwar Shariff"], "subtitle": "How to Install, use, and customize this powerful, free, Open Source Java-based Enterprise CMS", "topics": ["Java", "Content Management (CMS)", "All Books", "Alfresco", "CMS and eCommerce"], "publication date": "2007-01-30"}
{"index": {"_id":"36"}}
{"detailed description": "GWT Ajax Programming shows you how to create reliable user interfaces that enhance the user experience.\nGWT is an open source Java software development framework that makes writing AJAX applications like Google Maps and Gmail easy for developers who don't speak browser quirks as a second language. Writing dynamic web applications today is a tedious and error-prone process; you spend 90% of your time working around subtle incompatibilities between web browsers and platforms, and JavaScript's lack of modularity makes sharing, testing, and reusing AJAX components difficult and fragile.\nGWT lets you avoid many of these headaches while offering your users the same dynamic, standards-compliant experience. You write your front end in the Java programming language, and the GWT compiler converts your Java classes to browser-compliant JavaScript and HTML.\n\r\r\n\nChapter-by-Chapter\n\r\r\n\nChapter 1\n introduces GWT, the download and installation of GWT, and running its sample application.\n\r\r\n\nChapter 2\n deals with the creation of a new GWT application from scratch, and using the Eclipse IDE with GWT projects, creating a new AJAX Random Quotes application, and running this new application.\n\r\r\n\nChapter 3\n deals with an introduction to and overview of GWT asynchronous services, and creating a prime number service and geocoder service.\n\r\r\n\nChapter 4\n deals with using GWT to build simple interactive user interfaces. The samples included in this chapter are live search, auto fillable forms, sortable tables, dynamic lists, and a flickr-style editable lable.\n\r\r\n\nChapter 5\n introduces some of the more advanced features of GWT to build more complex user interfaces. The samples included in this chapter are pageable tables, editable tree nodes, a simple log spy, sticky notes, and a jigsaw puzzle.\n\r\r\n\nChapter 6\n includes an introduction to JavaScript Native Interface (JSNI) and using it to wrap third-party JavaScript libraries like Moo.fx and Rico. it also includes using the gwt-widgets project and its support for the Script.aculo.us effects.\n\r\r\n\nChapter 7\n deals with creating custom GWT widgets. The samples included in this chapter are a calendar widget and a weather widget.\n\r\r\n\nChapter 8\n concerns itself with creating and running unit tests for GWT services and applications.\n\r\r\n\nChapter 9\n sees us using Internationalization (I18N) and client-side XML support in GWT.\n\r\r\n\nChapter 10\n includes the deployment of GWT applications using both Ant and Eclipse.", "isbn": "1847191002", "title": "Google Web Toolkit GWT Java AJAX Programming", "price_gbp": 34, "audience": "Readers will need experience writing non-trivial applications using Java. Experience with developing web interfaces is useful, but knowledge of JavaScript and DHTML is not requiredâ€¦ GWT takes care of that!\n \n\r\r\n\n \n\r\r\n\n ", "authors": ["Prabhakar Chaganti"], "subtitle": "A step-by-step guide to the Google Web Toolkit for creating Ajax applications fast", "topics": ["Web Development", "Java", "AJAX", "Google", "All Books", "Web Development"], "publication date": "2007-02-15"}
{"index": {"_id":"37"}}
{"detailed description": "PHP-Nuke es una herramienta gratuita para gestionar el contenido de un sitio web dinámico. Como una de las aplicaciones más populares en Internet, PHP-Nuke se ha convertido en una herramienta sofisticada y robusta con un número extraordinario de características y una comunidad leal de seguidores. A través de una interfaz web, los usuarios pueden editar y administrar sus propios sitios web sin necesitar conocimientos en programación web. PHP-Nuke es ideal para construir un sitio web comunitario, donde los visitantes pueden crear cuentas, comentar e interactuar con el sitio y contribuir con material de forma sencilla. PHP-Nuke tiene muchas de las características que querría ver en un sitio web, como artículos de noticias, evaluaciones de artículos, comentarios, foros de discusión y su apariencia puede ser modificada mediante la utilización de temas.\nSi quiere crear un sitio web potente, rico en funcionalidades útiles para los usuarios, en poco tiempo, este libro es para usted. Este libro le ayudará a explorar PHP-Nuke, enseñándole que puede ofrecerle y como sacarle el máximo partido.\n \nA medida que avancemos en la lectura del libro veremos la realización de un sitio web de prueba que le llevará a conocer todas las características de PHP-Nuke. Se introducirán los componentes principales de PHP-Nuke y aprenderá como administrarlos. Desarrollará las habilidades y confianza suficientes para administrar todos los tipos de contenidos del sitio web y también aprenderá como los usuarios trabajan e interactúan con el sitio.\nPara asegurarse de crear un sitio web que tiene el diseño que quiere, el libro cubre la personalización de los temas para ayudarle a definir la apariencia de las páginas de su sitio.\nAunque PHP-Nuke permite conseguir estos objetivos sin necesidad de programación web, para extender la funcionalidad de su sitio tendrá que “mancharse las manosï¿½? con algo de código. El libro le conduce a través de la inclusión de su propio código a PHP-Nuke, le muestra las funciones que utiliza para las operaciones fundamentales del sitio y como se generan las páginas.", "isbn": "1904811426", "title": "Construyendo sitios web con PHP-Nuke [Espanol]", "price_gbp": 23, "audience": "Este libro está escrito para ayudar a crear sitios web completamente funcionales de una forma rápida y sencilla. La ayudará un conocimiento básico en HTML si intenta personalizar la apariencia de su sitio web y le será muy útil conocer PHP si quiere sacar el máximo partido de los capítulos que tratan sobre como extender PHP-Nuke", "authors": ["Jesús Sánchez Jara [Traductor]", "Douglas Paterson"], "subtitle": "Una guía práctica para crear y mantener su propio sitio web comunitario con PHP-Nuke, el conocido sistema gestor de contenidos gratuito y de código abierto", "topics": ["Portuguese, Espanol, Italiano, French", "Content Management (CMS)", "All Books", "Web Development", "Web Development", "Web Development", "Web Development"], "publication date": "2007-02-20"}
{"index": {"_id":"38"}}
{"detailed description": "e107 is a PHP-based content management system that uses the popular open source MySQL database system for content storage. e107 is released under the terms of the GNU General Public License and is completely free, totally customizable and in constant development. It is an ideal tool for developing small to large dynamic community websites, intra company portals, corporate portals, weblogs and much more. It has a large, enthusiastic, and helpful community of users.\nIf you want to create a powerful, fully-featured website in no time, this book is for you. This book will help you explore e107, putting you in the picture of what it offers, and how to go about building a site with the system. \nThe book covers all the core features of e107, and it is thorough and incremental tutorial approach it gives you the understanding to experiment with advanced features and customization.", "isbn": "1904811310", "title": "Building Websites with e107", "price_gbp": 30, "audience": "This book is primarily for entrepreneurs, small office/home office, small businesses and non-profit agencies who would like to have interactive, business and/or e-commerce web sites at a low cost without sacrificing power or usability. No knowledge of PHP programming, Apache, or MySQL is required.\n\r\r\n\n ", "authors": ["Tad Boomer"], "subtitle": "A step by step tutorial to getting your e107 website up and running fast", "topics": ["Open Source", "Free eBooks", "Content Management (CMS)", "All Books", "CMS and eCommerce"], "publication date": "2007-02-26"}
{"index": {"_id":"39"}}
{"detailed description": "The book has 8 chapters, each dealing with a different aspect of TYPO3 and by the end you can genuinely claim to have tamed the beast that is TYPO3. \n\r\r\n\nTYPO3 is a popular, free, feature-rich open source content management system. It has the flexibility and scalability to more than match commercial systems and allow you to build a powerful and complex website. Because of its complex system and numerous extensions, TYPO3 can be daunting on first approach and the initial learning curve can be steep. However the nature of its advanced features will reward an extra investment in learning.", "isbn": "1847191118", "title": "Building Websites with TYPO3", "price_gbp": 30, "audience": "This book is aimed at anyone who would like to quickly build a TYPO3 website. This book is written for first-time users of TYPO3 and has been specifically created so that you do not require detailed knowledge of programming or web development.\n \n\r\r\n\n \n\r\r\n\n ", "authors": ["Michael Peacock"], "subtitle": "A practical guide to getting your TYPO3 website up and running fast", "topics": ["Open Source", "Content Management (CMS)", "CMS and eCommerce", "All Books"], "publication date": "2007-03-15"}
{"index": {"_id":"40"}}
{"detailed description": "Este libro es una guía completa que le ayuda a sacar partido del potencial de phpMyAdmin. Ya sea un programador experimentado, un administrador de sistemas, un diseñador Web o nuevo a las tecnologías de MySQL y phpMyAdmin, este libro le mostrará como aumentar su productividad y control cuando trabaje con MySQL.  \nPor ello se ha traducido, de modo que esta guía completa sea más accesible al lector español.\nphpMyAdmin es una herramienta que todos aquellos que tienen que administrar bases de datos y tablas MySQL deben tener. Este libro es de lectura obligatoria para todo usuario serio de phpMyAdmin a quien le gustaría usar todo el potencial de esta sobresaliente aplicación.", "isbn": "1904811981", "title": "Dominar phpMyAdmin para una administración efectiva de MySQL [Espanol]", "price_gbp": 23, "audience": "NULL", "authors": ["Marc Delisle"], "subtitle": "Descubra el poder real de phpMyAdmin. Aumente su productividad y control de MySQL.", "topics": ["All Books", "Portuguese, Espanol, Italiano, French", "Web Development", "Web Development", "Web Development", "Web Development"], "publication date": "2007-03-23"}
{"index": {"_id":"41"}}
{"detailed description": "CherryPy is a Python library for web development that allows developers to build web applications in the same way as any other object-oriented Python program. Enriched by several years of active development, it has become one of the most established toolkits for building solid and high-performance web applications in Python. CherryPy abstracts the complex low-level HTTP protocol into an easy-to-use interface that respects Python idioms. The library aims at being simple to learn for a beginner while offering the most advanced features to fluent Python developers. For these reasons CherryPy was chosen to be at the heart of the popular and feature-rich TurboGears web framework. CherryPy-powered web applications are stand-alone Python applications with their own embedded multi-threaded web server, but can also run behind Apache or IIS for scalability.", "isbn": "1904811841", "title": "CherryPy Essentials: Rapid Python Web Application Development", "price_gbp": 30, "audience": "This book is principally geared towards Python web developers, who are looking to add the power of the CherryPy library to their existing Python skillset. It assumes a good working knowledge of Python. Although the CherryPy toolkit is at the core of the book, many other common libraries are introduced \n\r\r\n\n\r\r\n\n \n\r\r\n\n ", "authors": ["Sylvain Hellegouarch"], "subtitle": "Design, develop, test, and deploy your Python web applications easily", "topics": ["Open Source", "Content Management (CMS)", "Web Development", "All Books"], "publication date": "2007-03-31"}
{"index": {"_id":"42"}}
{"detailed description": "Partendo da una conoscenza di base di PHP, XML, JavaScript e MySQL, questo libro vi aiuterà a comprendere il funzionamento delle funzionalità principali di AJAX e come le sue componenti lavorano insieme. Dopo aver affrontato i fondamenti, il libro vi guiderà attraverso numerosi casi di studio reali che affrontano delle problematiche che potreste incontrare nuovamente nelle vostre applicazioni:\n\r\r\n\n\r\r\n\nValidazione di form lato server\n\r\r\n\nCollaborazione tramite chat online\n\r\r\n\nUna soluzione per il suggerimento del testo mentre si digita\n\r\r\n\nGrafici in tempo reale usando SVG\n\r\r\n\nUna griglia di dati personalizzabile, modificabile e basata su database\n\r\r\n\nUn aggregatore RSS\n\r\r\n\nLista ordinabile gestita sul server e con supporto al drag-and-drop grazie al toolkit JavaScript script.aculo.us\n\r\r\n\n\r\r\n\nLe Appendici vi guideranno nell’installazione dell’ambiente di lavoro e nell’uso di potenti strumenti per il debugging, l’ottimizzazione ed il profiling del vostro codice e di XPath e XSLT.\nFrom the Author, Cristian Darie\n\"AJAX e PHP: Sviluppare applicazioni web dinamiche è principalmente un libro per principianti, ma quando ne abbiamo definito la struttura abbiamo cercato di trovare degli argomenti che possano interessare sia ai novizi che agli sviluppatori web esperti per fare un grosso passo in avanti. Un lettore è stato molto gentile e ci ha fatto sapere tramite una sua recensione che avevamo avuto successo:\n\"La teoria che sta dietro tutte le tecnologie usate è spiegata molto chiaramente, evitando di annoiare il lettore con dettagli sulle cose ovvie. Sin dal primo capitolo si impara tramite esempi, che possono essere adattati facilmente per l’uso in molti altri progetti web e trattano argomenti utili ma allo stesso tempo divertenti.\"\n\r\r\n\n\r\r\n\nEcco qui alcuni esempi di queste cose “utili e divertenti” che si possono trovare all’interno del libro:\n\r\r\n\ndettagli sull’uso di script proxy per aggirare le misure di sicurezza dei browser moderni\n\r\r\n\ncodice lato client e lato server che funziona anche in presenza di caratteri speciali (quali <, \", ecc...)\n\r\r\n\ncodice che funziona in maniera efficiente con Internet Explorer 5, 6 e 7, Firefox, Opera, Safari e altri\n\r\r\n\nuna rapida introduzione a SVG, il nuovo inquilino ribelle del web\n\r\r\n\ncomunicazione client-server basata su una coda che garantisce che i messaggi non vengano persi e che arrivino in ordine a destinazione\n\r\r\n\ntecniche per la gestione dello stato lato server che usano i parametri della query string e i record di un database per tenere traccia delle attività del client\n\r\r\n\nstrutture per la gestione degli errori semplici ma efficaci che combinano codice JavaScript e PHP per avvisare quando avviene qualcosa di errato sul client o sul server\n\r\r\n\nuna pagina di errata che viene aggiornata non appena qualcuno invia un suggerimento o una correzione\n\r\r\n\nun tutorial AJAX amichevole e molti casi di studio che insegnano come usare insieme JavaScript, PHP, MySQL e XML per ottenere risultati incredibili\n\r\r\n\n\r\r\n\nGli autori del libro e l’editore ascoltano i vostri commenti e apprezzano che investiate del tempo per farci sapere cosa pensate. Il primo risultato di questa collaborazione è la versione aggiornata del caso di studio AJAX Chat che sfrutta (e insegna) JSON invece di XML. Potete trovare questo capitolo scaricando il codice o nel mio sito.\nGrazie per essere arrivati in fondo a questolungo messaggio. Buon divertimento!\" Cristian Darie.", "isbn": "1847192203", "title": "AJAX e PHP:Sviluppare applicazioni web dinamiche [Italiano]", "price_gbp": 26, "audience": "Questo libro è rivolto a lettori con conoscenze di base di PHP, XML, JavaScript e MySQL, che vogliono sapere come funziona il cuore di AJAX e come le tecnologie che lo compongono lavorano insieme.\n                                                                                                                                                                                             \n\r\r\n\n ", "authors": ["Cristian Darie", "Mihai Bucica", "Bogdan Brinzarea", "Filip Cherecheş-Toşa"], "subtitle": "NULL", "topics": ["Portuguese, Espanol, Italiano, French", "All Books", "Web Development", "Web Development", "Web Development", "Web Development"], "publication date": "2007-04-05"}
{"index": {"_id":"43"}}
{"detailed description": "Este libro muestra como construir un sistema telefónico para su casa o negocio usando la aplicación de fuente libre y código abierto, Asterisk. 'Construyendo un Sistema Telefónico con Asterisk' le lleva paso a paso por el proceso de instalar y configurar Asterisk. Le muestra como crear un plan de trabajo y como crear un plan de discado.\nEl libro también presenta configuraciones de ejemplo para usar Asterisk en tres escenarios diferentes: para oficinas pequeñas, oficinas en casa y PBX anfitrión.\nCon un estilo que encaja y una forma excelente de presentar la información, este libro hace de un tema complicado algo muy fácil de entender.", "isbn": "1904811728", "title": "Construyendo Sistemas telefónicos con Asterisk [Espanol]", "price_gbp": 23, "audience": "Este libro esta dirigido a todas las personas con interés hacia el sistema Asterisk. Los conocimientos técnicos en el sistema operativo Linux y en Telefonía pueden ser de gran ayuda pero no es una condicionante para adentrarse en este fascinante mundo de Asterisk.", "authors": ["David Gomillion"], "subtitle": "NULL", "topics": ["Open Source", "All Books", "Portuguese, Espanol, Italiano, French", "Networking & Telephony", "Networking and Servers"], "publication date": "2007-04-10"}
{"index": {"_id":"44"}}
{"detailed description": "Each chapter of this book deals with a different aspect, and provides recipes for easy-to-use hacks to customize and simplify your Vim experience. After an introduction covering the derivation of Vim and its relatives from the vi editor, the author explains basic changes that you can make to the appearance of the Vim editor. Further chapters cover improved navigation through files and buffers in Vim; speeding up your work with templates, auto-completion, folding, sessions, and registers; and formatting text and code, including using external formatting scripts. The final comprehensive chapter covers everything about using Vim scripts and scripting to extend functionality.\nVim stands for Vi IMproved and is the editor of choice for programmers looking for a highly configurable, stable, open-source, multi-platform text editor. It is included with almost every Linux distribution as the standard text editor, and can be used to work with source code from any language. A big advantage of using Vim is that it can be extensively customized; you can control the basic interface, define personalized key mappings, implement macros, and call external or user-defined scripts. Vim has its own scripting language that allows for plug-in like extensions to enable IDE behavior, syntax scripts and highlighting, color schemes, themes, and utility scripts that can add a wide range of features and functionality. \nVim 7.0, for which this book is written, includes spell-checking, code completion, document tabs, current line and column highlighting, undo branches, and more.", "isbn": "1847190936", "title": "Hacking Vim: A Cookbook to get the Most out of the Latest Vim Editor", "price_gbp": 30, "audience": "Anyone who has worked with Vim and wants to get more out of this legendary text editor can use the hacks from this book. \nIt does not cover the basic tasks of using the editor but instead focuses on making life easier for more experienced Vim users.\n\r\r\n\n ", "authors": ["Kim Schulz"], "subtitle": "From personalizing Vim to productivity optimizations: Recipes to make life easier for experienced Vim users", "topics": ["Open Source", "Linux Servers", "Application Development", "All Books"], "publication date": "2007-05-25"}
{"index": {"_id":"45"}}
{"detailed description": "This is a complete study guide including study material and practice questions to prepare for the EMC Proven Professional certification Exam E20-120. It can also serve Documentum beginners and practitioners as a handy guide and quick reference to the technical fundamentals that is fully up to date for Documentum 5.3. Beginners are introduced to concepts in a logical manner while practitioners can use it as a reference to jump to relevant concepts directly.\nEMC Documentum is a leading enterprise content management technology platform that helps enterprises to streamline the capture, processing, and distribution of business information including documents, records, e-mails, web content, images, reports, and digital assets. It can also automate entire business processes in accordance with business rules. \nEMC Proven Professional is an exam-based certification program, which introduced a new EMC Proven Content Management Application Developer (EMCAD) track in early 2007. The first exam in this track is Content Management Foundations (CMF) Associate-level Exam, with exam code E20-120, which tests knowledge about technical fundamentals of Documentum. This book is a study guide to help you prepare for this exam with hundreds of practice questions and an efficient exam-preparation strategy.", "isbn": "1847192408", "title": "Documentum Content Management Foundations: EMC Proven Professional Certification Exam E20-120 Study Guide", "price_gbp": 46, "audience": "This book is targeted at beginner and intermediate-level Documentum developers and professionals interested in learning the technical fundamentals of Documentum. The book focuses on preparing for the E20-120 exam, which makes it an ideal study guide for those taking the EMC Proven Professional Associate Level Certification in content management.\n\r\r\n\n \n\r\r\n\n ", "authors": ["Pawan Kumar"], "subtitle": "Learn the technical fundamentals of the EMC Documentum platform while effectively preparing for the E20-120 exam", "topics": ["Enterprise", "Content Management (CMS)", "All Books", "CMS and eCommerce"], "publication date": "2007-06-13"}
{"index": {"_id":"46"}}
{"detailed description": "EN DETAILS\nLes services web sont la plateforme technique de base requise pour l’interopérabilité des applications. Ils ne permettent pas toutefois de contrôler l’ordre et la manière dont les opérations qu’ils exposent sont invoquées. Ils ne fournissent pas non plus de moyen de décrire la sémantique des interfaces, les workflows ou les processus métier électroniques. BPEL est le chaînon manquant qui permet d’assembler et d’intégrer les services web dans des processus réels.\nBPEL standardise l’automatisation des processus entre services web, qu’ils soient déployés au sein de l’entreprise afin d’intégrer des systèmes auparavant isolés, ou entre entreprises pour faciliter l’intégration entre partenaires commerciaux.\nEn fournissant une structure de description standard, BPEL permet aux entreprises de définir leurs processus durant la phase de conception. Ceci engendre des bénéfices encore plus larges en permettant d’optimiser ces processus, de les ré-agencer et de sélectionner les plus appropriés.\nSupporté par les grands éditeurs de logiciels —BEA, Hewlett-Packard, IBM, Microsoft, Novell, Oracle, SAP, Sun et d’autres — BPEL est en train de devenir le standard en matière de gestion des processus métier (BPM ou Business Process Management).\nCe livre couvre de façon exhaustive le langage, sa syntaxe et son usage. Il commence par donner une vue d’ensemble des services web, leurs fondements et justifie le besoin d’un langage tel que BPEL. La couche technologique des services web est décrite, y compris les standards tels que WS-Security, WS-Coordination, WS-Transaction, WS-Addressing et d’autres. Le langage BPEL lui-même est décrit en détail et des extraits de code ainsi que des exemples complets illustrent à la fois sa syntaxe et les constructions de processus typiques. Après avoir traité du langage, le livre aborde la façon de le mettre en œuvre en donnant une vue d’ensemble des principaux serveurs BPEL. Deux d’entre eux, Oracle BPEL Process Manager et Microsoft BizTalk Server 2004 sont traités en détail et des exemples complets de mise en œuvre à l’aide de ces serveurs sont fournis.", "isbn": "1847192165", "title": "BPEL pour les services web : Deuxième Edition [French]", "price_gbp": 53, "audience": "Audience de ce livre\nArchitectes et développeurs concernés par la conception, l’implémentation et l’intégration de systèmes d’information avancés et de solutions e-business, développant des processus métier et confrontés à des problèmes de composition, orchestration, transactions, coordination et sécurité. Ce livre suppose une connaissance de XML et des services web (J2EE ou .NET) et des architectures multi-tiers.", "authors": ["Poornachandra Sarang", "Matjaz B. Juric", "Dalil Djidel [Traducteur]", "Benny Mathew"], "subtitle": "Orchestration de services web avec BPEL : guide pour architectes et développeurs", "topics": ["Web Services", "SOA", "Portuguese, Espanol, Italiano, French", "Java", "BPEL", "Architecture & Analysis", "All Books", "Enterprise Products and Platforms"], "publication date": "2007-07-23"}
{"index": {"_id":"47"}}
{"detailed description": "CodeIgniter (CI) is a powerful open-source PHP framework with a very small footprint, built for PHP coders who need a simple and elegant toolkit to create full-featured web applications. CodeIgniter is an MVC framework, similar in some ways to the Rails framework for Ruby, and is designed to enable, not overwhelm.\nThis book explains how to work with CodeIgniter in a clear logical way. It is not a detailed guide to the syntax of CodeIgniter, but makes an ideal complement to the existing online CodeIgniter user guide, helping you grasp the bigger picture and bringing together many ideas to get your application development started as smoothly as possible.", "isbn": "1847191746", "title": "CodeIgniter for Rapid PHP Application Development ", "price_gbp": 26, "audience": "This book is for developers who are new to CodeIgniter. Basic skills in PHP and MySQL are required, but only rudimentary object-oriented knowledge is required.  \nIf you're looking for a better way to develop PHP applications, or want to find out more about the CodeIgniter framework as a viable option for one of your own projects, this book will help you.\n\r\r\n\n \n\r\r\n\n ", "authors": ["David Upton"], "subtitle": "Improve your PHP coding productivity with the free compact open-source MVC CodeIgniter framework!", "topics": ["PHP", "Open Source", "Web Development", "All Books"], "publication date": "2007-07-23"}
{"index": {"_id":"48"}}
{"detailed description": "JBoss jBPM is a free, open-source, business process management solution. It enables users to create business processes that coordinate people, applications, and services.\nA business process is a sequence of activities triggered by a certain input that results in a valuable output. Business Process Management is about analyzing those activities in a structured way and eventually supporting their execution with a workflow application. This allows for the following results:\n\r\r\n\n\r\r\n\nBetter management visibility of their business: improved decision making\n\r\r\n\nLow cost of inputs: de-skilled labor requirements, less waste, standardized components\n\r\r\n\nBetter outputs: consistent quality, more customer satisfaction \n\r\r\n\n\r\r\n\nBusinesses have always tried to manage their processes, but software such as jBPM brings the methodology and management theory to practical life.\nJBoss jBPM offers the following key features:\n\r\r\n\n\r\r\n\nGraphical process definition\n\r\r\n\nFlexibility to integrate code into the graphical process definition\n\r\r\n\nA customizable web-based workflow application that runs the process youâ€™ve defined\n\r\r\n\nEasy programming model to extend the graphical process definition\n\r\r\n\nA process-oriented programming model (jPDL) that blends the best of process definition languages and Java.\n\r\r\n\nEasy to integrate with other systems through the JBoss middleware suite.\n\r\r\n", "isbn": "184719236X", "title": "Business Process Management with JBoss jBPM", "price_gbp": 37, "audience": "This is a book for Business Analysts (BAs) who need to develop a process model for implementation in a business process management system. Developers looking at the JBoss jBPM toolset will also find it a useful introduction to the key concepts.\nThis book is a full toolkit for someone who wants to implement BPM in the right way. This toolkit is particularly aimed at Business Analysts, although Project Managers, IT managers, developers, and even business people can expect to find useful tools and techniques in here. We will present the project framework, analysis techniques and templates, BPM technology and example deliverables that you need to successfully bring a BPM solution into your organization.\n\r\r\n\n ", "authors": ["Matt Cumberlidge"], "subtitle": "A Practical Guide for Business Analysts", "topics": ["JBoss", "Enterprise", "Enterprise Products and Platforms", "All Books"], "publication date": "2007-07-30"}
{"index": {"_id":"49"}}
{"detailed description": "BlackBerry Enterprise Server is a platform that extends corporate messaging and collaboration services to BlackBerry devices, supports management and administration of those devices, and also supports deployment of third-party applications on the BlackBerry device platform. BlackBerry Enterprise Server supports a variety of messaging platforms, including Microsoft Exchange, IBM Lotus Domino, and Novell GroupWise. \nThis book focuses on BlackBerry Enterprise Server for Microsoft Exchange, providing detailed information on planning and implementing a BlackBerry Enterprise Server deployment. The basics of installing BlackBerry Enterprise Server are familiar for most administrators, but the server is infinitely configurable and contains extended administration features. This book contains background information on these features to help you get the most out of your environment, picking up where the manufacturerâ€™s documentation leaves off. If you are new to BlackBerry Enterprise Server, this is the perfect guide to help with your planning and deployment.", "isbn": "1847192467", "title": "BlackBerry Enterprise Server for Microsoft® Exchange", "price_gbp": 34, "audience": "This book is written for IT professionals and network administrators who need to implement a BlackBerry Enterprise Server. The text assumes basic familiarity with Microsoft Windows Server administration, but provides detailed instructions for administrators with varying levels of experience.", "authors": ["Mitesh Desai", "Dan Renfroe"], "subtitle": "Installation and Administration", "topics": ["All Books", "Networking & Telephony", "Enterprise", "Enterprise Products and Platforms"], "publication date": "2007-10-22"}
{"index": {"_id":"50"}}
{"detailed description": "Many web applications are implemented in a way that makes developing them painful and repetitive. Catalyst is an open-source Perl-based Model-View-Controller framework that aims to solve this problem by reorganizing your web application to design and implement it in a natural, maintainable, and testable manner, making web development fun, fast, and rewarding.\nEverything that your web application needs to do is only written once; you connect to the database in one place, have configuration in one place, etc. Then, you just write actions for each URL that your application needs, without worrying about the database connections or HTML to produce. Catalyst will handle the details so you can worry about writing your application.\nCatalyst is designed to be reliable. There are hundreds of production applications and thousands of users. The code is well-tested, and new releases almost always maintain compatibility with applications written for older versions. You don't have to worry about Catalyst breaking your application and slowing down your development. It just works.\nMost importantly, Catalyst has a thriving community. You can ask a question on the IRC channel and get a response at almost any time of the day.\n \nThis book embodies Catalyst's philosophies of Do It Yourself and Don't Repeat Yourself.", "isbn": "1847190952", "title": "Catalyst", "price_gbp": 30, "audience": "This book is for web developers with basic Perl skills who are new to Catalyst. If you are excited by Ruby on Rails but would like the features of Rails with the familiarity of Perl, pick this book and get started.", "authors": ["Jonathan Rockway"], "subtitle": "Accelerating Perl Web Application Development", "topics": ["Open Source", "Architecture & Analysis", "All Books", "Networking and Servers"], "publication date": "2007-12-11"}
{"index": {"_id":"51"}}
{"detailed description": "Sql Server Integration Services (SSIS) is a comprehensive ETL tool that made its debut with SQL Server 2005. It is a tool tightly integrated with the Visual Studio 2005 having all the functionalities that its forerunner DTS (Data Transformation Services) had in SQL Server 2000. This does not mean that it is just an improvement over DTS but a product which is totally different with a vastly improved interface; an extensible architecture; an enlarged tool set; ease of integration with other SQL Server Tools such as Analysis Services; capable of supporting connectivity with third party databases and bringing into a central location many database management tasks. \nThe Beginners Guide to SQL Server Integration Services Using Visual Studio 2005 provides you with the basic knowledge that you should have before you move on to more advanced ETL [Extraction, Transformation, and Loading]. The book will also provide you with a comprehensive description of the many designer windows that you may encounter while working with the designer. \nThis guide provides you with the blocks to build a complete package. It describes each block using examples as well as detailing the nuts and bolts that hold the blocks in place. The majority of SSIS tasks are covered in this book, which are described in full in the summary of \nTable of Contents\n. You will start building packages right from Chapter 2 and continue on to Chapter 20 gathering and building upon your knowledge in each step.\n\r\r\n\n \n\r\r\n\n ", "isbn": "1847193315", "title": "Beginners Guide to SQL Server Integration Services Using Visual Studio 2005", "price_gbp": 30, "audience": "This book is written for beginners in the developer track who are looking to get an exposure to SQL Server Integration Services; DBA's who are testing water with the Visual Studio IDE but without a wide programming experience; SQL 2000 Data Transformation Services users who are trying to move into SQL Server 2005 Integration Services; Microsoft programming professionals in Small Businesses who wear multiple hats (jack of all) - developer, programmer, and dba with a little bit of experience in each of these. \nIt is expected that you know how to manipulate window objects, like clicking; dragging and dropping; using contextual help, tabbing, etc. It is also expected that you are exposed to SQL Server database basics and that you understand connecting to a database server; querying the database; reviewing objects; displaying and reviewing properties of objects, etc.  Very little coding skill is assumed except that you can logically follow a fully commented code.\nThis book is ideal for trainers who may want to teach an introductory course in SQL Server Integration Services or, to those who want to study and learn SSIS in a little over two weeks.", "authors": ["Jayaram Krishnaswamy"], "subtitle": "NULL", "topics": ["Microsoft SQL Server", "Microsoft", "Enterprise", "Microsoft Servers", "Enterprise Products and Platforms", "All Books"], "publication date": "2007-12-30"}
{"index": {"_id":"52"}}
{"detailed description": "The ASP.NET Data Presentation Controls are server controls to which you can bind data to organize and display it in different ways.\n\r\r\n\nThis book shows you how to get the most from these controls to easily display and manage complex data in your web applications. It takes you through each of the major data presentation controls in ASP.NET, gets you started using them, and then shows you how to use them in your applications for managing your data.", "isbn": "1847193951", "title": "ASP.NET Data Presentation Controls Essentials", "price_gbp": 30, "audience": "This book is for ASP.NET developers who want to display or manage data in ASP.NET applications. The code examples are in C#.", "authors": ["Joydip Kanjilal"], "subtitle": "Master the standard ASP.NET server controls for displaying and managing data", "topics": [".NET", "Microsoft", "Enterprise", "Microsoft Development ", "All Books", "Web Development"], "publication date": "2007-12-31"}
{"index": {"_id":"53"}}
{"detailed description": "Drupal is an award winning open source Content Management System. Based on PHP/MySQL, its power and flexibility combined with its exceptional design mean it is already on the way to becoming the de facto standard for CMS Websites. Drupalâ€™s modular design and structured source code make it both highly flexible and easily extended and modified. Drupal is extremely scalable, making it ideal for both a simple personal website as well as an industrial strength commercial or institutional web presence.\nDrupal is a model open source project in that it has a large, friendly community of people who contribute to the project in various ways.  Drupal is not only free and easy to use, but this community provides on going mutual support.", "isbn": "1847191827", "title": "Drupal 5 Themes", "price_gbp": 30, "audience": "NULL", "authors": ["Ric Shreves"], "subtitle": "Create a new theme for your Drupal website with a clean layout and powerful CSS styling", "topics": ["Open Source", "All Books", "Drupal", "CMS and eCommerce"], "publication date": "2007-12-31"}
{"index": {"_id":"54"}}
{"detailed description": "Composite applications aid businesses by stitching together various componentized business capabilities. In the current enterprise scenario, empowering business users to react quickly to the rapidly changing business environment is the topmost priority. With the advent of composite applications the â€˜reuseâ€™ paradigm has moved from the technical aspect to the business aspect. You no longer re-use a service. You re-use a business process. Now enterprises can define their own behaviors optimized for their businesses through metadata and flows. This business process composition has become increasingly important for constructing business logic.\n\r\r\n\nThe ability of composite applications to share components between them nullifies the distinction between actual applications. Business users should be able to move between the activities they need to do without any actual awareness that they are moving from one domain to another. \n\r\r\n\nThe composite application design enables your company to combine multiple heterogeneous technologies into a single application, bringing key application capabilities within reach of your business user. Enterprises creating richer composite applications by leveraging existing interoperable components increase the organizationâ€™s ability to respond quickly and cost-effectively to emerging business requirements. \n\r\r\n\nWhile there are many vendors offering various graphical tools to create composite applications, this book focuses \non using the BPEL service engine from the \nOpenESB project\n for solving business integration problems. Project OpenESB implements an Enterprise Service Bus runtime using Java Business Integration (JBI) as the base. This allows easy integration of web services to create loosely coupled enterprise-class composite applications. \n\r\r\n\nThe objective of this book is to help enterprise application architects and developers to understand various SOA tools available as part of the NetBeans IDE that will enable them to build an enterprise-grade, scalable application in a short period using a single development interface. The NetBeans SOA tools form an open-source and freely available add-on to the NetBeans IDE that is targeted for enterprise application development. This pack contains open-sourced features from Sun's Java Studio Enterprise and Java CAPS products, as well as all-new features for creating composite applications, BPEL-based web services, secure Java EE web services, and real-world XML artifacts like XML Schema and WSDL. Part of NetBeans Enterprise Pack is integrated with NetBeans 6.0, so you don't need to download additional add-ons or plug-ins if you are using NetBeans version 6.0 or higher. However, not all OpenESB components are integrated with NetBeans 6.0. For instance you may not be able to create an Intelligent Event Processor using the standard NetBeans IDE; these components can be downloaded and installed into the NetBeans IDE.", "isbn": "1847192629", "title": "Building SOA-Based Composite Applications Using NetBeans IDE 6 ", "price_gbp": 37, "audience": "This book is for enterprise developers and architects interested in using NetBeans IDE and OpenESB tools to build their SOA based applications.", "authors": ["Frank Jennings", "David Salter"], "subtitle": "Design, build, test, and debug service-oriented applications with ease using XML, BPEL, and Java web services", "topics": ["Web Services", "SOA", "Java", "Enterprise", "BPEL", "All Books", "Enterprise Products and Platforms"], "publication date": "2008-02-06"}
{"index": {"_id":"55"}}
{"detailed description": "", "isbn": "1847192882", "title": "AsteriskNOW", "price_gbp": 30, "audience": "This book is for complete beginners who are interested in setting up their own telephony system and are overwhelmed with the configuration options in Asterisk. It shows how to install and configure AsteriskNow and configure the required dial plan.", "authors": ["Nir Simionovich"], "subtitle": "A practical guide for deploying and managing an Asterisk-based telephony system using the AsteriskNOW Beta 6 software appliance", "topics": ["Open Source", "Networking & Telephony", "Linux Servers", "All Books", "Networking and Servers"], "publication date": "2008-03-12"}
{"index": {"_id":"56"}}
{"detailed description": "Ruby on Rails is an open-source web application framework ideally suited to building business applications; accelerating and simplifying the creation of database-driven websites. Often shortened to Rails or RoR, it provides a stack of tools to rapidly build web applications based on the Model-View-Controller design pattern.\n \nThis book is a tutorial for creating a complete website with Ruby on Rails. It will teach you to develop database-backed web applications according to the Model-View-Controller pattern. It will take you on a joy ride right from installation to a complete dynamic website. All the applications discussed in this book will help you add exciting features to your website. This book will show you how to assemble RoR's features and leverage its power to design, develop, and deploy a fully featured website. Each chapter adds a new feature to the site, adding new knowledge, skills, and techniques.", "isbn": "1847193412", "title": "Building Dynamic Web 2.0 Websites with Ruby on Rails", "price_gbp": 26, "audience": "This book is for anyone who has basic concepts of object-oriented programming as well as relational databases and wants to develop online applications using Ruby on Rails. Prior knowledge of Ruby or Rails is not expected.", "authors": ["A P Rajshekhar "], "subtitle": "Create database-driven dynamic websites with this open-source web application framework", "topics": ["Open Source", "Web Development", "All Books"], "publication date": "2008-03-28"}
{"index": {"_id":"57"}}
{"detailed description": "Joomla! started as a fork from Mambo in 2005, when many of the original developers of the Mambo CMS moved to working on Joomla! It has rapidly grown in popularity and, according to its own description, is a \"Cutting Edge Content Management System and one of the most powerful Open Source Content Management systems in the world. It is used world-wide for anything from simple homepages to complicated corporate websites. It is easy to install, easy to manage and very reliable.\"\nWhile the Joomla! CMS has the flexibility and power needed for complex, full-featured web applications, it is also simple to use to create basic websites. Its powerful, extensible template system can deal many different data types and control of user access, approval of content, scheduling of content display, and rich administrative controls are all included.", "isbn": "184719530X", "title": "Building Websites with Joomla! 1.5", "price_gbp": 34, "audience": "This book is suitable for web developers, designers, webmasters, content editors, and marketing professionals who want to develop a website in a simple and straightforward process. It does not require any detailed knowledge of programming or web development, and any IT-confident individual will be able to use the book to produce an impressive website.", "authors": ["Hagen Graf"], "subtitle": "The best-selling Joomla! tutorial guide updated for the latest 1.5 release", "topics": ["Open Source", "CMS and eCommerce", "All Books"], "publication date": "2008-03-28"}
{"index": {"_id":"58"}}
{"detailed description": "Elgg is an open-source social web application licensed under GPL version 2, and runs on the LAMP (Linux, Apache, MySQL, and PHP) or WAMP (Windows, Apache, MySQL, PHP) platform. It offers a networking platform combining elements of blogging, e-portfolios, news feed aggregation, file sharing, and social networking. Elgg has its own plug-in architecture, and can use plug-ins to provide a calendar and a wiki. It supports a number of open standards including RSS, LDAP for authentication, FOAF, and XML-RPC for integration with most third-party blogging clients. It can be integrated with MediaWiki, Moodle, Drupal, and WebCT.\nElgg provides each user with a personal weblog, file repository (with podcasting capabilities), an online profile, and an RSS reader. Additionally, all of a user's content can be tagged with keywordsâ€”so they can connect with other users with similar interests and create their own personal learning network. However, where Elgg differs from a regular weblog or a commercial social network (such as MySpace) is the degree of control each user is given over who can access their content. Each profile item, blog post, or uploaded file can be assigned its own access restrictionsâ€”from fully public to readable only by a particular group or individual.\nUsing Elgg is the easiest way to create your own fully customized, hosted social network for your business, organization, or group of friends. Elgg communities can include blogs, discussion groups, media galleries, friends' lists, and much more. Because it's open source, and has many plug-ins, Elgg can be extended in unlimited ways. Elgg lets you host your own Facebook-style social network and retain complete control over how it works. This book shows you all you need to know to create safe, fun social networks.\n \nWhile anybody can use Elgg to create their social network, it is especially useful in education as it has many features making it suitable for e-learning, including groups, communities, and blogs that can be used for online classes where students can communicate in a new way with each other and with students around the worldâ€”in a managed, protected environment, creating what its authors term a \"personal learning landscape\". This book also covers using Elgg in teaching/learning.", "isbn": "1847192807", "title": "Elgg Social Networking", "price_gbp": 26, "audience": "This book is aimed at people interested in social networking and e-learning teachers. ", "authors": ["Mayank Sharma"], "subtitle": "Create and manage your own social network site using this free open-source tool", "topics": ["Open Source", "All Books", "CMS and eCommerce"], "publication date": "2008-03-28"}
{"index": {"_id":"59"}}
{"detailed description": "Drupal is a hugely popular and widely celebrated open-source Content Management System that is day-by-day becoming the first choice of people for building blogs and other websites. Sir Tim Berners-Lee (the father of the Internet), Hillary Clinton, and many others utilize Drupal to fulfil their online requirements.\nDrupal is an elegantly designed, well-supported and flexible platform that anyone can use in order to create their own website. With such a powerful tool at your fingertips there is no longer any need to pay professionals to design a site when you can do the same job yourself absolutely free. All it takes is a bit of practice!\nThis book meets the booming demand for well presented, clear, concise, and above all practical information on how to move from knowing you want a website all the way through to designing and building it like a pro, and finally successfully managing and maintaining it.\nExperienced technical author David Mercer expertly guides the reader through all the stages of building a professional website in a plain, articulate manner. Aimed in particular at beginners to Drupal, this book will allow readers to advance rapidly up the learning curve to the point where they can tackle any problem with confidence.", "isbn": "1847192971", "title": "Building Powerful and Robust Websites with Drupal 6", "price_gbp": 34, "audience": "This book is for people with little or no experience in website design, people who are not familiar with PHP, MySQL or HTML, and above all people with little to no experience in using Drupal. Even intermediate Drupal users will find this book of interest although it is specifically aimed at pushing beginners up the learning curve.", "authors": ["David Mercer"], "subtitle": "Build your own professional blog, forum, portal or community website with Drupal 6", "topics": ["Web Development", "Open Source", "Drupal", "Content Management (CMS)", "All Books", "CMS and eCommerce"], "publication date": "2008-04-04"}
{"index": {"_id":"60"}}
{"detailed description": "OpenSER is a flexible, free open-source VoIP server based on the Session Initiation Protocol (SIP), an application-layer control (or signaling) protocol for creating, modifying, and terminating sessions with one or more participants, including internet telephone calls, multimedia distribution, and multimedia conferences.\n \nEngineered to power IP telephony infrastructures up to large scale, OpenSER is written in pure C for Linux/Unix-like systems with architecture-specific optimizations to offer high performance; it is able to handle 4 million users on a single processor server. The server keeps track of users, sets up VoIP sessions, relays instant messages, and creates space for new plug-in applications. \nIt can be used on systems with limited resources as well as on carrier-grade servers, scaling up to thousands of call setups per second. It is customizable, being able to feature as fast load balancer; SIP server flavors: registrar, location server, proxy server, redirect server; gateway to SMS/XMPP; or advanced VoIP application server.", "isbn": "1847193730", "title": "Building Telephony Systems with OpenSER", "price_gbp": 34, "audience": "This book is for readers who want to understand how to build a SIP provider from scratch using OpenSER. Telephony and Linux experience will be helpful but is not essential. Readers need not have prior knowledge of OpenSER.", "authors": ["Flavio E. Goncalves"], "subtitle": "A step-by-step guide to building a high performance Telephony System", "topics": ["Open Source", "All Books", "Networking & Telephony", "Linux Servers", "Networking and Servers"], "publication date": "2008-04-25"}
{"index": {"_id":"61"}}
{"detailed description": "Blogger is a blog publishing system from Google with a friendly interface specifically designed for creating and maintaining weblogs.\nIt allows users to easily create dynamic blogs with great content and many outstanding features including RSS feeds, link-backs, photo slideshows, and integration with popular Google applications like Picasa. Its versatility and ease of use has attracted a large, enthusiastic, and helpful community of users.\nIf you want to create powerful, fully-featured blogs in no time, this book is for you. This book will focus on transforming a typical blog into something fresh and professional that stands out from the crowd. It starts with an  introduction to an example blog, discussing what it is lacking, and then adding all the features of Blogger to make it successful. This book will tell you how to transform a slow-paced typical business blog into an attractive and interactive profit-making blog with measurable results. It has a very user-friendly approach and shares tips, tricks, and resources to continue to grow your blog.", "isbn": "184719317X", "title": "Blogger: Beyond the Basics", "price_gbp": 30, "audience": "The book is aimed at current users of the Blogger platform who want to get the most out of Blogger and people who use a different blogging platform and are planning on switching to Blogger. Blog owners who promote their own services, expertise, and products, and want to increase their blog's success by pushing the limits of what Blogger can do will get the most out of this book.\nThe book doesn't require any specific knowledge of Blogger or the related technologies: RSS, CSS, HTML, and XML. Everything you need to know to grow beyond the basics is covered in this book. The companion website to this book (\nhttp://bloggerbeefedup.blogspot.com\n) includes free resource images and content.", "authors": ["Lee Jordan"], "subtitle": "Customize and promote your blog with original templates, analytics, advertising, and SEO", "topics": ["Java", "Content Management (CMS)", "All Books", "CMS and eCommerce"], "publication date": "2008-05-06"}
{"index": {"_id":"62"}}
{"detailed description": "DotNetNuke is an open-source web application framework written in VB.NET for the ASP.NET framework. The application's content management system is extensible and customizable through the use of skins and modules, and it can be used to create, deploy, and manage intranet, extranet, and websites.\nDotNetNuke has a skinning architecture, which provides a clear separation between design and content, enabling a web designer to develop skins without requiring any specialist knowledge of development in ASP.NET; only knowledge of HTML and an understanding of how to prepare and package the skins themselves are required.\nIf you want to create great-looking skins for your DotNetNuke websites, this book is for you. If you're new to DotNetNuke skinning, this book is the ideal introduction. It will give you clear, concise and practical guidance to take you from the basics of DotNetNuke skinning right through to developing the skills to make you a DotNetNuke skinner to be reckoned with!\nThis book gives you step-by-step instructions to the fundamentals of skinning so that you will be in control of the look and feel of your DotNetNuke site, and dreaming of new ideas for creating more interactive user interfaces.", "isbn": "1847192785", "title": "DotNetNuke Skinning Tutorial", "price_gbp": 26, "audience": "This book is for web designers or developers who want to customize DNN sites, to bring a specific look and feel to them, and create more attractive user interfaces.\nThis book is ideal for beginners to DotNetNuke skinning.\nYou will need to know about the general operation of DotNetNuke and also have some familiarity with creating web pages. Familiarity with CSS and basic ASP.NET would be a bonus.", "authors": ["Darren Neese"], "subtitle": "A simple, clear, step-by-tutorial to creating DotNetNuke skins to put you in control of the look and feel of your DotNetNuke website", "topics": ["Open Source", ".NET", "Microsoft", "DotNetNuke", "Content Management (CMS)", "Microsoft Development ", "All Books", "CMS and eCommerce"], "publication date": "2008-05-20"}
{"index": {"_id":"63"}}
{"detailed description": "NULL", "isbn": "1847193986", "title": "Aptana RadRails: An IDE for Rails Development", "price_gbp": 30, "audience": "This book is for Ruby on Rails developers who want to make the most of the framework by using an Integrated Development Environment. \nEven though the book explains everything you need to follow the contents, the focus is on how to use the tool and not on the Rails framework itself, so previous working knowledge of Rails is highly advisable. Previous knowledge of Eclipse is not necessary.", "authors": ["Javier Ramírez"], "subtitle": "Develop Ruby on Rails applications fast using RadRails 1.0 Community Edition", "topics": ["AJAX", "Web Development", "Web Development", "Open Source", "All Books"], "publication date": "2008-05-23"}
{"index": {"_id":"64"}}
{"detailed description": "", "isbn": "1847195601", "title": "EJB 3 Developer Guide", "price_gbp": 30, "audience": "This book is primarily aimed at professional developers who already have a working knowledge of Java. Enterprise architects and designers with a background in Java would also find this book of use. Previous experience of working with Java is essential and knowledge of relational databases is desirable. \nAs this book is an introduction to EJB 3, it is aimed at those who are new to EJB 3. As the new version of EJB is so radically different from the previous version (EJB 2.x), the book is suitable for and should be of interest to those who have had experience working with EJB 2.x. The text makes it clear where the differences between the versions of EJB lie, although they are not explored in detail.", "authors": ["Michael Sikora"], "subtitle": "A Practical Guide for developers and architects to the Enterprise Java Beans Standard.", "topics": ["Java", "Enterprise", "All Books", "Application Development"], "publication date": "2008-05-23"}
{"index": {"_id":"65"}}
{"detailed description": "This book will show you how to create realistic architectural models in Blender. Blender is an open-source 3D animation program released as free software. It can be used for modeling, texturing, skinning, animating, and so on. It runs on all the important operating systems (including Windows, Mac, and Linux).\nYou can create natural scenery, landscapes, plants, various weather conditions, environmental factors, building materials such as wood, metal, brick, and more. You will also learn how to add people to different scenes as well as other objects to an already existing photograph or a video making it easier to increase its realism.\nYou will see how to use the final models to create simpler scenes for use in 3D games, where real-time rendering is necessary. You will also see how to use them to create the sets for animated movies.", "isbn": "1847193676", "title": "Blender 3D Architecture, Buildings, and Scenery", "price_gbp": 34, "audience": "This book is for architects, game designers, artists, or movie makers who want to create realistic buildings, interiors, and scenery using Blender 3D, a free, open-source graphics tool. This book is not a general introduction to Blender, but focuses on developing expertise on the architectural aspects of the tool. Readers need not have prior knowledge of Blender.", "authors": ["Allan Brito"], "subtitle": "Create photorealistic 3D architectural visualizations of buildings, interiors, and environmental scenery", "topics": ["Web Graphics & Video", "Open Source", "Blender", "Other", "All Books"], "publication date": "2008-05-30"}
{"index": {"_id":"66"}}
{"detailed description": "Murphy's law states that anything that can go wrong will go wrong. In relation to Information Systems and Technology this could mean an incident that completely destroys data, slows down productivity or causes any other major interruption of your operations or your business. How bad can it get?—\"Most large companies spend between 2% and 4% of their IT budget on disaster recovery planning; this is intended to avoid larger losses. Of companies that had a major loss of computerized data, 43% never reopen, 51% close within two years, and only 6% will survive long-term.\" —Jim Hoffer, Backing Up Business – Industry Trend or Event.\n\r\r\n\nActive Directory (AD) is a great system but it is also very delicate. If you get a problem, you will need to know how to recover from this situation. You will need to know about Disaster Recovery and be prepared with a business continuity plan. If Active Directory is a part of the backbone of your network and infrastructure, the guide to bring it back online in case of an incident needs to be as clear and concise as possible. If all of this happens or if you want to avoid all of this happening, this is the book for you. \nRecovering Active Directory from any kind of disaster is trickier than most people think. If you do not understand the processes associated with recovery, you can cause more damage than you fix. This is why you need this book.\nThis book has a unique approach—the first half focuses on planning and shows you how to configure your AD to be resilient; the second half is response focused and meant as a reference in which we discuss different disaster scenarios. We follow a Symptom-Cause-Recovery approach—so all you have to do is follow along and get back on track.\nThis book describes the most common scenarios and how to properly recover your infrastructure from them. It contains commands and steps for each process and contains information on how to plan for disaster and how to leverage technologies in your favor in case of a disaster. \nYou will encounter these types of disaster and incident in the book, and learn how to recover from them:\n\r\r\n\n\r\r\n\nDeleted objects\n\r\r\n\nSingle domain controller hardware failure\n\r\r\n\nSingle domain controller AD corruption\n\r\r\n\nSite AD corruption\n\r\r\n\nSite hardware failure\n\r\r\n\nCorporate AD corruption\n\r\r\n\nComplete corporate hardware failure\n\r\r\n", "isbn": "1847193277", "title": "Active Directory Disaster Recovery", "price_gbp": 44, "audience": "This book is targeted at network security professionals who find themselves charged with creating an Active Directory Disaster Recovery plan or who want to quickly recover once disaster has struck.\nThis book expects you to be familiar with the basics of Active Directory and Windows Servers.", "authors": ["Florian Rommel"], "subtitle": "Expert guidance on planning and implementing Active Directory disaster recovery plans", "topics": ["Microsoft", "Enterprise", "Microsoft Servers", "Networking and Servers", "All Books"], "publication date": "2008-06-24"}
{"index": {"_id":"67"}}
{"detailed description": "A bad response time on a website can drive away visitors and prospective customers. To measure what a website can handle, there should be a way to simulate and analyze different load scenariosâ€”this is where a load-testing tool like JMeter comes in. JMeter is a powerful desktop performance tool from the Apache Jakarta project, written in Java, for load-testing web pages, web applications, and other static and dynamic resources including databases, files, Servlets, Perl scripts, Java Objects, FTP Servers, and more.\nJMeter works by acting as the \"client side\" of an application, and measures response time. As such, it's one half of the testing arsenal; the other half consists of a tool to watch metrics on the server side, such as thread counts, CPU loads, resource usage, and memory usage. Although it can't behave like a browser to measure rich client-side logic such as JavaScripts or Applets, JMeter certainly measures the performance of the target server from the client's point of view. JMeter is able to capture test results that help you make informed decisions and benchmark your application.\nThis book introduces you to JMeter (version 2.3) and test automation, providing a step-by-step guide to testing with JMeter. You will learn how to measure the performance of a website using JMeter.\nWhile it discusses test automation generally, the bulk of this book gives specific, vivid, and easy-to-understand walkthroughs of JMeter's testing tools showing what they can do, and when and how to use them.", "isbn": "1847192955", "title": "Apache JMeter", "price_gbp": 30, "audience": "The ideal readers or users of this book are experienced or novice testers who have been testing manually and now would like to automate their tests. Those testers who are already automating their testing using other tools or testing software may also want to use this book as they look for alternatives. This book would also be a good point for test Managers/Leaders to start doing research on the test automation tool that may best suit their testing needs and of course, their budget\nJMeter's target audience is the testing community, which is generally not the hangout of developers or technical people. Almost anything one would like to do in HTTP testing will be supported by JMeter without requiring any programming.\nThe user need not have much technical knowledge to work with JMeter. It has a simple-to-use and intuitive drag-and-drop style GUI that helps any non-technical user to get started.", "authors": ["Emily H. Halili"], "subtitle": "A practical beginner's guide to automated testing and performance measurement for your websites", "topics": ["All Books", "Java", "App Testing", "Open Source", "Networking and Servers"], "publication date": "2008-06-27"}
{"index": {"_id":"68"}}
{"detailed description": "Adobe ColdFusion is an application server, renowned for rapid development of dynamic websites, with a straightforward language (CFML), powerful methods for packaging and reusing your code, and AJAX support that will get developers deep into powerful web applications quickly.\nThis book is the most intense guide to creating professional ColdFusion applications available. Packed with example code, and written in a friendly, easy-to-read style, this book is just want you need if you are serious about ColdFusion. \nThis book will give you clear, concise and, of course, practical guidance to take you from the basics of ColdFusion 8 to the skills that will make you a ColdFusion developer to be reckoned with.\nColdFusion expert John Farrar will teach you how about the basics of ColdFusion programming, application architecture, and object reuse, before showing you a range of topics including AJAX library integration, RESTful Web Services, PDF creation and manipulation, and dynamically generated presentation files that will make you the toast of your ColdFusion developer town.\nThis book digs deep with the basics, with real-world examples of the how and whys, to get more done faster with ColdFusion 8.\nThis book also covers the new features of ColdFusion 8 Update 1.", "isbn": "1847194125", "title": "ColdFusion 8 Developer Tutorial", "price_gbp": 37, "audience": "This book is for web developers working with ColdFusion 8.\nIf your goal is to get a good grounding in the basics of the language as quickly as possible and put a site together quickly, this book is ideal for you. If you want to learn more about professional programming of ColdFusion, this book is definitely for you.\nNo prior knowledge of ColdFusion is expected, but basic knowledge of general web and software development skills is assumed.", "authors": ["John Farrar"], "subtitle": "An intense guide to creating professional ColdFusion web applications: get up to speed in ColdFusion and learn how to integrate with other web 2.0 technologies", "topics": ["AJAX", "All Books", "Web Development", "Web Development"], "publication date": "2008-07-02"}
{"index": {"_id":"69"}}
{"detailed description": "Este libro te ayudará a comprender cómo funciona AJAX y cómo se integra las tecnologías necesarias para hacerlo funcionar. Tras presentar las nociones básicas, el libro te invita a aprender con ejemplos reales que cubren una amplia variedad de tareas que te serán de gran utilidad en el desarrollo de tus aplicaciones:\n\r\r\n\n\r\r\n\nValidación de formularios desde el servidor\n\r\r\n\nDesarrollo de una herramienta de chat online\n\r\r\n\nSugerir y autocompletar en cajas de texto\n\r\r\n\nGráficas en tiempo real utilizando SVG\n\r\r\n\nAcceso a una base de datos mediante tablas editables y configurables\n\r\r\n\nConstrucción de un agregador RSS\n\r\r\n\nDesarrollo de una aplicación de gestión de listas con soporte para arrastrar y soltar utilizando JavaScript y el toolkit script.aculo.us\n\r\r\n\n\r\r\n\nLa traducción al castellano de este libro supone una referencia acerca de las tecnologías más demandadas del momento en el desarrollo web donde, hasta ahora, apenas existía documentación rigurosa en nuestro idioma.", "isbn": "1847191312", "title": "AJAX y PHP: Construyendo Aplicaciones Web Interactivas [Espanol]", "price_gbp": 26, "audience": "Este libro está destinado a principiantes y a programadores de nivel intermedio, donde unos conocimientos mínimos de PHP, XML, JavaScript y MySQL siempre son bienvenidos. Sin embargo, el conjunto de temas y casos prácticos incluido será de gran ayuda al desarrollador web de cualquier nivel.", "authors": ["Cristian Darie", "Bogdan Brinzarea", "Filip Cherecheş-Toşa", "Mihai Bucica"], "subtitle": "NULL", "topics": ["All Books", "Portuguese, Espanol, Italiano, French", "Web Development", "AJAX", "Web Development", "Web Development", "Web Development"], "publication date": "2008-07-04"}
{"index": {"_id":"70"}}
{"detailed description": "Cake is a rapid development framework for PHP that uses well-known design patterns and provides a structured framework that enables PHP users at all levels to rapidly develop robust web applications, without any loss of flexibility. It means you can code faster, your code is better, and it makes writing Web 2.0-style apps a snap.\nThis book offers step-by-step instructions to learn the CakePHP framework and to quickly develop and deploy web-based applications. It introduces the MVC pattern and coding styles using practical examples. It takes the developer through setting up a CakePHP development and deployment environment, and develops an example application to illustrate all of the techniques you need to write a complete, non-trivial application in PHP. It aims to assist PHP programmers to rapidly develop and deploy well-crafted and robust web-based applications with CakePHP.", "isbn": "1847193897", "title": "CakePHP Application Development", "price_gbp": 30, "audience": "If you already know PHP and want to develop cutting-edge Web 2.0 applications, or see how to write code in a faster, more productive way, then this book is ideal for you.", "authors": ["Anupom Syam", "Ahsanul Bari"], "subtitle": "zable\">\n\r\r\n\nStep-by-step introduction to rapid web development using the open-source MVC CakePHP framework", "topics": ["PHP", "Open Source", "Web Development", "All Books"], "publication date": "2008-07-15"}
{"index": {"_id":"71"}}
{"detailed description": "ExpressionEngine is a flexible, feature-rich open-source content management system used by thousands of individuals, organizations, and companies to easily manage their websites. It is written in the world's most popular web scripting language, PHP, and built on the MySQL database server. This book is written for ExpressionEngine 1.6 users, although it will still be a good introduction for those using other versions.\nIf you're eager to start creating websites with ExpressionEngine, this is your book. This book gives you clear, concise and, of course, practical guidance to take you from the basics of setting up ExpressionEngine to developing the skills you need to create professional ExpressionEngine websites to be reckoned with.\nThis book will take you through the process of setting up a website with ExpressionEngine with the help of an example site. By creating a site for selling toast online, you will learn all the stages required for building a professional website in a plain, articulate manner.\nThis book is aimed at beginners new to ExpressionEngine, but will allow readers to advance rapidly up the learning curve to the point where they can tackle any task with confidence.\nOnce you're set up with a basic installation of ExpressionEngine, you will move on to learn about creating and managing your content, customizing the look of your site, managing users and groups, allowing visitors to post comments and feedback, building an events calendar, and building a photo gallery. The book also covers the discussion forum module, the simple commerce module, and the wiki module as well as basics such as creating search-engine friendly URLs, 404 \"page not found\" pages, removing the index.php file for cleaner URLs and updating ExpressionEngine to the latest version.", "isbn": "184719379X", "title": "Building Websites with ExpressionEngine 1.6", "price_gbp": 30, "audience": "This book is ideal for new users of ExpressionEngine. The book is targeted at people who are responsible for creating and managing a site with ExpressionEngine. It is suitable for web developers, designers, webmasters, content editors, and marketing professionals who want to develop a fully featured web presence in a simple and straightforward process.", "authors": ["Leonard Murphy"], "subtitle": "A clear, concise, and practical guide to creating a professional ExpressionEngine website", "topics": ["Content Management (CMS)", "All Books", "Web Development"], "publication date": "2008-07-28"}
{"index": {"_id":"72"}}
{"detailed description": "Modeling business processes for SOA and developing end-to-end IT support has become one of the top IT priorities. The SOA approach is based on services and on processes. Processes are focused on composition of services and in that sense services become process activities.\nExperience has shown that the implementation and optimization of processes are the most important factors in the success of SOA projects. SOA is so valuable to businesses because it enables process optimization. In order to optimize processes, we need to know which processes are relevant and we have to understand them â€“ something that cannot be done without business process modeling. There is a major problem with this approach â€“ a semantic gap between the process model and the applications.\nThis book will show you how to fill this gap. It describes a pragmatic approach to business process modeling using the Business Process Modeling Notation (BPMN) and the automatic mapping of BPMN to the Business Process Execution Language (BPEL), which is the de-facto standard for executing business processes in SOA. The book will also cover related technologies like Business Rules Management and Business Activity Monitoring which play a pivotal role in achieving closed loop Business Process Management.", "isbn": "1847191460", "title": "Business Process Driven SOA using BPMN and BPEL", "price_gbp": 46, "audience": "This book is for CIOs, executives, SOA project managers, business process analysts, BPM and SOA architects, who are responsible for improving the efficiency of business processes through IT, or for designing SOA. It provides a high-level coverage of business process modeling, but it also gives practical development examples on how to move from model to execution. We expect the readers to be familiar with the basics of SOA.", "authors": ["Matjaz B. Juric", "Kapil Pant"], "subtitle": "From Business Process Modeling to Orchestration and Service Oriented Architecture", "topics": ["Oracle", "Enterprise", "SOA", "Oracle Fusion Middleware", "BPEL", "Architecture & Analysis", "Enterprise Products and Platforms", "All Books", "Web Services"], "publication date": "2008-08-28"}
{"index": {"_id":"73"}}
{"detailed description": "Python is a dynamic programming language, used in a wide range of domains by programmers who find it simple, yet powerful. From the earliest version 15 years ago to the current one, it has constantly evolved with productivity and code readability in mind.\nEven if you find writing Python code easy, writing code that is efficient and easy to maintain and reuse is not so straightforward. This book will show you how to do just that:  it will show you how Python development should be done. Python expert Tarek ZiadÃ© takes you on a practical tour of Python application development, beginning with setting up the best development environment, and along the way looking at agile methodologies in Python, and applying proven object-oriented principles to your design.", "isbn": "184719494X", "title": "Expert Python Programming", "price_gbp": 34, "audience": "This book is for Python developers who are already building applications, but want to build better ones by applying best practices and new development techniques to their projects.\nThe reader is expected to have a sound background in Python programming.", "authors": ["Tarek Ziadé"], "subtitle": "Best practices for designing, coding, and distributing your Python software", "topics": ["Python", "Open Source", "Application Development", "All Books"], "publication date": "2008-09-19"}
{"index": {"_id":"74"}}
{"detailed description": "The Common UNIX Printing System (CUPS) is software that allows a computer to act as a print server, receiving print jobs from client computers, managing them, and sending them to the appropriate printer. It consists of a print spooler and scheduler, filters to convert print jobs to the format required by each printer, and a backend system to send the data to the chosen printer from client applications. Since every printer manufacturer does things differently, printing can be very complicated, and has always been a hard issue in the UNIX world for this reason. By providing a portable, modular printing layer, CUPS brings printing for UNIX into the modern age. It applies open standards for network printing through the Internet Printing Protocol (IPP) and uses platform-independent drivers (Postscript Printer Definition, PPD) to print. Today, CUPS is the default printing system for a large number of Linux distributions (Ubuntu, Fedora, etc.) and UNIX-based operating systems.\nThis book assumes that you have no knowledge of CUPS. It starts by telling you the story of how CUPS came to be and why there is such excitement about it. We then move on to installing, compiling, and managing your print network. Haven't you struggled to find the right directives for your printer? Enough of that search, this book will tell you where to find what. Not only that, but widely used directives and their uses are explained here along with directions to use them. There is more: you can learn how to manage the ever increasing print job load, set up your clients, and manage users. All this done, you will learn how to monitor, filter, and secure your CUPS server.", "isbn": "1847192580", "title": "CUPS Administrative Guide", "price_gbp": 30, "audience": "This book is for Linux/Unix System Administrators interested in designing and setting up a CUPS network and provides enough knowledge to understand how the technology works, make decisions about deployment, and then implement a stable work environment. No knowledge in CUPS is required but readers need to be comfortable with working in the Linux/Unix environment. On the whole, readers should have basic knowledge of the Linux environment.", "authors": ["Ankur Shah"], "subtitle": "A practical tutorial to installing, managing, and securing this powerful printing system", "topics": ["Open Source", "All Books", "Other"], "publication date": "2008-09-30"}
{"index": {"_id":"75"}}
{"detailed description": "Drupal is an award winning open source Content Management System (CMS). Based on PHP/MySQL, its power and flexibility combined with its exceptional design mean it is one of the most popular choices for creating a CMS website.\nDrupal employs a specialized templating system and supports themes, which allow you to change the look and feel of the system's front and back-end interfaces. \nDrupal 6 Themes is an ideal introduction to theming with Drupal 6. If you want to create a striking new look for your Drupal 6 website, this book is for you. This book is a revised, updated and expanded edition of Drupal 5 Themes, written specifically for Drupal 6. The book will show you techniques and tools to help you improve the look and feel of any Drupal 6-powered website\nStarting from the basics of theme setup and configuration, you will learn about the Drupal theming architecture and the PHPTemplate engine, and then move on to modifying existing themes and building new themes from scratch. You will find out about tools to make your theme development easier, and also find invaluable information about under-documented elements of the theming system.", "isbn": "1847195660", "title": "Drupal 6 Themes", "price_gbp": 30, "audience": "The main requirements to make use of this book are knowledge of HTML, CSS, and a touch of creativity - you don't need to know anything about theming in Drupal, although you should be familiar with the basic operation of the Drupal system.\nAlthough this book aims to make Drupal theming accessible to designers, theming in Drupal 6 involves writing some PHP code, and a basic knowledge of PHP will be helpful.\nRegardless of your technical skills, this book will teach you to design themes for your Drupal websites in the easiest way.", "authors": ["Ric Shreves"], "subtitle": "Create new themes for your Drupal 6 site with clean layout and powerful CSS styling", "topics": ["Open Source", "Content Management (CMS)", "All Books", "Drupal", "CMS and eCommerce"], "publication date": "2008-09-30"}
{"index": {"_id":"76"}}
{"detailed description": "Application architecture is an essential skill for ASP.NET developers. It is always tempting to jump in and start coding, but planning your architecture early in the project will leave you with a solid application that scales well, is easy to modify and extend, and saves you time and effort later on. As businesses struggle to control their costs, writing solid code that can be extended easily is becoming even more important.\nThis book takes a pragmatic approach to Application Architecture in ASP.NET 3.5. It presents a series of common architectural models, and shows how to select the best ones for your project and apply them. \nThe book begins by showing you how to use the main architectural models in your applications. You will see how to implement n-tier architectures, MVC, design patterns, and more. But this is no software engineering theory book â€“ it is a practical, hands-on guide that shows you how to use these techniques in your software straight away. We then go on to build SOA (Service-Oriented Architecture) applications with the Windows Communication Framework (WCF). Finally the book contains some essential guidance on effective database design, and a chapter on localizing your applications.\nThis book is a great way to learn ASP.NET Architecture in a practical, hands-on way. It will also serve as a quick reference for improving your application design.", "isbn": "1847195504", "title": "ASP.NET 3.5 Application Architecture and Design", "price_gbp": 30, "audience": "This book is for people familiar with the ASP.NET framework using either C# or VB.NET. You donâ€™t need to be an ASP.NET guru â€“ the book is ideal for novice and intermediate developers.\nIf reading about application architecture usually confuses you or sends you to sleep, then this book will be perfect for you! In short, any ASP.NET programmer who is confused or disoriented reading different books or materials on architectures wondering how and what to implement in their application, will definitely benefit from this book!", "authors": ["Vivek Thakur"], "subtitle": "Build robust, scalable ASP.NET applications quickly and easily.", "topics": [".NET", "Microsoft", "Architecture & Analysis", "Microsoft Development ", "All Books", "Web Development"], "publication date": "2008-10-24"}
{"index": {"_id":"77"}}
{"detailed description": "AJAX enables rich desktop-like user interfaces in the browser and enables interactive interfaces that can even replace traditional user interfaces. DWR (Direct Web Remoting) is an Open Source Java framework for building AJAX applications. DWR's main idea is to hide AJAX implementation details, like XMLHttpRequest, from developers. By using DWR, you can concentrate on developing the application and business objects and leave AJAX details behind the scenes where they belong. DWR allows server-side Java classes to be used in the browser and JavaScript functions to be used on the server (Reverse AJAX).\nThis book will show competent Java programmers how to work with DWR to create powerful AJAX applications. It starts with a tutorial on DWR's main features and functions. Then it covers setting up the development environment. Finally, it concludes with some sample applications.\nThe later chapters are full of example code for sample applications, to aid comprehension.", "isbn": "1847192939", "title": "DWR Java AJAX Applications", "price_gbp": 30, "audience": "This book is written for competent Java developers and assumes that you are a professional rather than hobbyist. You should be familiar with the concepts of programming, Web 2.0, and AJAX.", "authors": ["Sami Salkosuo"], "subtitle": "A step-by-step example-packed guide to learning professional application development with Direct Web Remoting", "topics": ["Web Development", "Open Source", "Java", "AJAX", "All Books", "Application Development"], "publication date": "2008-10-29"}
{"index": {"_id":"78"}}
{"detailed description": "Adding and handling multimedia in Drupal, such as images or video, requires the use of many contributed modules, and deciding which ones to use and how to get the most from them is often not a straightforward task. \nThis book will guide you through the steps necessary to add image, video, and audio elements into your Drupal sites. The book will take you through the contributed modules for handling media, showing you what they do, when to use them, and how to get the most from them. When contributed modules aren't enough, you will see examples of custom Drupal development to add that special touch to your media.", "isbn": "1847194605", "title": "Drupal Multimedia", "price_gbp": 30, "audience": "This book will provide information for administrators and professional site developers who are required to embed multimedia into a Drupal site. The reader needs basic knowledge of Drupal operation, but no experience of how Drupal handles multimedia items is expected. ", "authors": ["Aaron Winborn"], "subtitle": "Create media-rich Drupal sites by learning to embed and manipulate images, video, and audio", "topics": ["Web Graphics & Video", "Open Source", "Drupal", "All Books", "CMS and eCommerce"], "publication date": "2008-10-30"}
{"index": {"_id":"79"}}
{"detailed description": "The ADO.NET Entity Framework is a new way to build the data access layer of your Windows or web applications. It's an Object Relational Mapping (ORM) technology that makes it easy to tie together the data in your database with the objects in your applications, by abstracting the object model of an application from its relational or logical model.\nThis clear and concise book gets you started with the Entity Framework and carefully gives you the skills to speed up your application development by constructing a better data access layer. It shows you how to get the most from the ADO.NET Entity Framework to perform CRUD operations with complex data in your applications.\nThis tutorial starts out with the basics of the Entity Framework, showing plenty of examples to get you started using it in your own code. You will learn how to create an Entity Data Model, and then take this further with Entity types. You will also learn about the Entity Client data provider, learn how to create statements in Entity SQL, and get to grips with ADO.NET Data Services, also known as Project Astoria.", "isbn": "1847195229", "title": "Entity Framework Tutorial", "price_gbp": 30, "audience": "This book is for C# developers who want an easier way to create their data access layer. You will need to be comfortable with ADO.NET, but you don't need to know anything about the Entity Framework. Along the way we will create some ASP.NET applications, so being familiar with this will also help.", "authors": ["Joydip Kanjilal"], "subtitle": "Learn to build a better data access layer with the ADO.NET Entity Framework and ADO.NET Data Services", "topics": ["Microsoft Development ", "Microsoft", "Enterprise", "All Books", ".NET", "Application Development"], "publication date": "2008-10-30"}
{"index": {"_id":"80"}}
{"detailed description": "Alfresco is an open source platform for Enterprise Content Management (ECM) solutions. ECM includes things like Document Management, Web Content Management, Collaboration/Enterprise 2.0, Digital Asset Management, Records Management, and Imaging. At its core is a repository for rich content like documents, web assets, XML, and multimedia. The repository is surrounded by a services layer (supporting both SOAP and REST) that makes getting content into and out of the repository a breeze, which is why so many next generation Internet solutions are built on Alfresco.\nImplementing Alfresco usually involves extending the repository to accommodate your business-specific metadata and business logic. These extensions are done using some combination of Java, JavaScript, XML, and FreeMarker. \nThis book takes you through a set of exercises as if you were rolling out and customizing the platform for a fictional organization called SomeCo, which wants to roll out Alfresco enterprise-wide. Each department has a set of requirements that need addressed. We will show you how to extend Alfresco to meet these requirements. By the time you've worked through the entire book, you will be familiar with the entire platform. You'll be prepared to make your own customizations whether they are part of a Document Management solution, a web site that uses Alfresco for content storage, or an entire custom application built on Alfresco's REST API. This book will give you the knowledge and confidence you need to make Alfresco do what you need it to do", "isbn": "1847193110", "title": "Alfresco Developer Guide", "price_gbp": 44, "audience": "This book will be most useful to developers who are writing code to customize Alfresco for their organization or who are creating custom applications that sit on top of Alfresco.\nThis book is for Java developers, and you will get most from the book if you already work with Java but you need not have prior experience on Alfresco. Although Alfresco makes heavy use of open source frameworks such as Spring, Hibernate, JavaServer Faces, and Lucene, no prior experience using these is assumed or necessary.", "authors": ["Jeff Potts"], "subtitle": "Customizing Alfresco with actions, web scripts, web forms, workflows, and more", "topics": ["Open Source", "Content Management (CMS)", "Alfresco", "CMS and eCommerce", "All Books"], "publication date": "2008-10-31"}
{"index": {"_id":"81"}}
{"detailed description": "Apache OFBiz (Open For Business) is versatile open-source enterprise automation software that powers many small and medium sized businesses around the world. It incorporates a number of mature applications such as ERP, e-Commerce, MRP and CRM.\nBuilt around an MVC framework with common logic, data model and process components, Ofbiz allows existing and bespoke applications to be added through a component-based architecture. Ofbiz includes a mature suite of enterprise applications that integrate and automate a company's many business needs.\n \nThis easy-to-read book will quickly enable newcomers to get hands-on with OFBiz. It provides an overview of the main modules and employs illustrated examples that show readers how to build exemplary business applications rapidly. Covering the main aspects of the Model-View-Controller framework, the reader will gain a working knowledge of Widgets, Entities, and The Service Engine. The authors also describe how to tweak OFBiz, and offer valuable performance and development tips. By navigating through the flow of OFBiz and providing insight into the thousands of examples that already exist in the core code they have made this book a must-have for anyone looking to get started with OFBiz.", "isbn": "1847194001", "title": "Apache OFBiz Development: The Beginner's Tutorial", "price_gbp": 37, "audience": "This book is for developers who want to build easily deployed and supported OFBiz applications. No previous knowledge of OFBiz is assumed, but readers should be comfortable in a Java development environment.", "authors": ["Jonathon Wong", "Rupert Howell"], "subtitle": "Using Services, Entities, and Widgets to build custom ERP and CRM systems", "topics": ["Open Source", "All Books", "Java", "Application Development"], "publication date": "2008-10-31"}
{"index": {"_id":"82"}}
{"detailed description": "Social media in the classroom provide unique opportunities for teaching and learning. This book helps you break through the hype, and shows you how to build a site in Drupal that incorporates the Web in your class, on your terms, to achieve specific learning goals.\nThis book provides the essential details to get the most out of your Drupal site. In clear, step-by-step instructions, you will learn how to build a site that is easy to use, easy to navigate, and supports the teaching and learning you want to emphasize.\nDrupal for Education and E-Learning provides a step-by-step overview of how to work with Drupal to build a feature-rich learning environment. In this book, you will learn how to configure the default Drupal installation, and how to extend your site to include social bookmarking, a podcasting and video sharing platform, image sharing, and interactive discussions around rich media content. You will also learn how to organize your site so that, as learning occurs over time, you and your students will be able to track their work history.", "isbn": "1847195024", "title": "Drupal for Education and E-Learning", "price_gbp": 34, "audience": "This book is for anybody looking to use Drupal to support teaching and learning; more generally, the examples given in this book can also be used by anybody looking to use Drupal to publish social media. This book is not a developer's manual; you do NOT need to know code, or HTML, or CSS, to benefit from this book. People new to Drupal will find clear examples describing how to set up their site. More experienced Drupallers will find tips and tricks for extending their site, and step-by-step instructions on how to make the most out of Drupal's flexibility.", "authors": ["Bill Fitzgerald"], "subtitle": "NULL", "topics": ["Web Development", "Open Source", "e-Learning", "Drupal", "CMS and eCommerce", "All Books"], "publication date": "2008-11-27"}
{"index": {"_id":"83"}}
{"detailed description": "Social Networking is all about developing connections or ties between friends and associates. While people have always networked with one another the Internet has allowed us to network with people all over the world easily. Any interest or cause can support its own social network, where fans and followers can meet, chat, and share their views. But building a social networking site from scratch involves some complex logic, and some serious coding.\nThis book shows how to build a scalable, enterprise-ready social network using ASP.NET. The book uses the latest features of ASP.NET to provide a platform that is efficient, easy to maintain, and extensible. Whether you want to build your own social network, are developing a social site for a customer or employer, or just want a practical guide to developing complex ASP.NET applications then this book is ideal for you.\nThe book starts by planning the essential features of our social network, and then building a 'community framework' that will give our site a solid foundation and enable us to add all our social networking features. We then go on to create user accounts, profile pages, messaging systems, 'friend' relationships between members, media galleries, blogs, message boards, groups, and more. Along the way you will see LINQ, MVC, AJAX, and other features of ASP.NET 3.5 put to practical and interesting uses.", "isbn": "1847194788", "title": "ASP.NET 3.5 Social Networking", "price_gbp": 37, "audience": "This book is written for ASP.NET and C# developers who want to build an enterprise-grade Social Network, either for their own business purposes or as a contract job for another company. \nThe book assumes you have prior experience of developing web applications using ASP.NET 3.5, C# 3.0, SQL Server 2005/2008, and Visual Studio .NET 2008; it focuses on topics that will be of interest to existing developers â€“ not on providing step-by-step examples for each detail.", "authors": ["Andrew Siemer"], "subtitle": "An expert guide to building enterprise-ready social networking and community applications with ASP.NET 3.5", "topics": [".NET", "Microsoft", "Microsoft Development ", "Web Development", "All Books"], "publication date": "2008-12-11"}
{"index": {"_id":"84"}}
{"detailed description": "Django is a high-level Python web application framework designed to support the rapid development of dynamic websites, web applications, and web services. Getting the most out of its template system allows programmers and designers to easily and efficiently output their content in a flexible, extendable, and maintainable manner.\nThis book will help you to master the Django template system. Built-in template tags and filters are explained with examples and usage notes, as well as information on building custom tags and filters to extend the system for your needs. You will learn to use inheritance to create modular templates that are easy to maintain. You will learn how to serve multiple templates from within the same Django project, with an example of how to serve different templates for a mobile version of your site without having to change any code in your views. Pagination, internationalization, caching, and customization of the automatic admin application are also covered.", "isbn": "1847195709", "title": "Django 1.0 Template Development", "price_gbp": 30, "audience": "This book is for web developers and template authors who want to fully understand and utilize the Django template system. The reader should have completed the introductory tutorials on the Django project's website and some experience with the framework will be very helpful. Basic knowledge of Python and HTML is assumed.", "authors": ["Scott Newman"], "subtitle": "A practical guide to Django template development with custom tags, filters, multiple templates, caching, and more", "topics": ["Web Development", "Open Source", "Web Development", "All Books"], "publication date": "2008-12-11"}
{"index": {"_id":"85"}}
{"detailed description": "Certified Information Systems Security Professional (CISSP) is an internationally recognized security qualification. Success in this respected exam opens the door to your dream job as a security expert as well as an eye catching salary. But passing the final exam is challenging. Every year a lot of candidates do not prepare sufficiently for the examination, and fail at the final stage. This happens when they cover everything but do not revise properly and hence lack in confidence.\nThis book will take you through the final weeks before the exam with a day-by-day plan covering all of the exam topics. It will help you to enter the exam room with confidence, knowing that you have done all you can to prepare for the big day.\nThis small and concise CISSP exam quick-revision guide provides a disciplined approach to be adopted for reviewing and revising the core concepts a month before the exam. This book provides concise explanation of important concepts in all the 10 domains of the CISSP Common Body of Knowledge (CBK). Each domain is covered in two chapters that are represented as days. Each chapter contains some practice questions.  A full-blown mock test is included for practice. This book is not a replacement to full study guides and tries to build on and reemphasize the concepts learned from such guides.", "isbn": "1847194508", "title": "CISSP in 21 Days", "price_gbp": 30, "audience": "This book is for all aspirants who are planning to take the CISSP examination and obtain the coveted CISSP certification that is considered as the 'Gold Standard' in Information Security personal certification.\nThis book assumes that the candidate has already sufficient knowledge in all the 10 domains of the CISSP CBK by way of experience from work and knowledge gained from other study books. This book provides concise explanations to the core concepts that are essentially covered in the exam.\nBesides being an Information Security-focused guide, this book will also be useful as a quick reference and revision guide for System and Network Administrators, Database Administrators, System Analysts, Software Developers, Application Designers, System Architects, Legal Professionals, Security Officers, Business Continuity professionals, IT Auditors, IS Auditors, Vulnerability Assessors, Penetration Testers, and Ethical Hackers.", "authors": ["M. L. Srinivasan"], "subtitle": "Boost your confidence and get a competitive edge to crack the exam", "topics": ["All Books", "Networking & Telephony", "Networking and Servers"], "publication date": "2008-12-19"}
{"index": {"_id":"86"}}
{"detailed description": "Everybody knows that a business needs a website for its growth and customer interface. However, building a website can be a difficult as well as time consuming process if you do it yourself. Simple website builders do not give you access to modern functionality and can be difficult to maintain. Paying a website designer to build a complete custom website can be very expensive and you need to pay every time you want a simple change.\nDrupal is a powerful, free system that anyone can use in order to create their own website. With such a powerful tool at your fingertips there is no longer any need to pay professionals to design a site when you can do the same job yourself absolutely free.\nThis book is your step-by-step guide to building your business website in Drupal, complete with a blog, events calendar, catalogue of products and services, and more.\nIn this book, we will build a complete website for a fictional client from scratch. We start at the beginning by downloading and installing Drupal, progress to creating and editing pages, and then we explore the most popular modules for Drupal. All functionality is presented in a clear step-by-step format which is easy to follow as you build your own site. \nThis book will explore several modules that will allow you to do everything from adding calendars and events to integrating content from Flickr and YouTube. Each chapter adds some features to your website and brings you closer to your customers.\nAt the end of the book, you should be able to build a site on your own or have the confidence and knowledge to hire a professional to develop a site for you which meets your business needs. You will get connected to your customers and find ways to make more money.", "isbn": "1847196403", "title": "Drupal 6 Site Builder Solutions", "price_gbp": 34, "audience": "This book is designed primarily for business owners who want to create a new website for their company or upgrade a company website to be easier to maintain and have advanced capabilities. \nWhether you know Drupal or not, this book will be your guide to a powerful website.", "authors": ["Mark Noble"], "subtitle": "Build powerful website features for your business and connect to your customers through blogs, product catalogs, newsletters, and maps", "topics": ["Web Development", "Open Source", "Drupal", "Content Management (CMS)", "All Books", "CMS and eCommerce"], "publication date": "2008-12-19"}
{"index": {"_id":"87"}}
{"detailed description": "Microsoft Dynamics NAV 2009 is the latest release of the NAV application (formerly known as Navision) from the Microsoft Dynamics family of products that brings a 3-tiered architecture, web services enablement, and many more exciting features, to the well established Enterprise Resource Planning (ERP) solution.\nAlthough Dynamics NAV is carefully designed for ease of use, attaining measurable business gains requires an understanding of business, finance, analysis and design techniques, programming skills, and the ability to manage complex projects coupled with an expert knowledge of the product itself.\nThis book distils hard won experience into an easy to follow guide to implementing the full power of Dynamics NAV in your business. It won't just tell you how to do it; it will show you how to do it. It will help you to become a better consultant or developer by providing practical examples and expert advice.\nFrom an introduction to the new RoleTailored user interface to a series of practical web services programming tutorials, you will gain a deep understanding of what NAV 2009 has to offer compared to previous versions. With a strong emphasis on practical examples, we take you through the implementation process and provide guidance on configuring the Chart of Accounts and Dimensions for financial analysis, how to use the Rapid Implementation Toolkit (RIM) to reduce implementation effort and an overview of the Sure Step implementation methodology. You will learn how to take a business problem through to a working solution using industry standard techniques such as use-case modelling and object-role modelling. We will teach you how to design and develop NAV objects including the new Page object and the Client Reporting Services report layouts.", "isbn": "1847195822", "title": "Implementing Microsoft Dynamics NAV 2009", "price_gbp": 44, "audience": "Dynamics NAV implementation consultants and developers that want to quickly understand the new features offered in the 2009 release.\nNAV consultants that want to learn more about programming and extensibility without needing to learn a programming language will also benefit from this book.\nNAV programmers that want to learn about finance configuration and solution design in order to be a better programmer and design better solutions can also use this book.", "authors": ["Vjekoslav Babić", "David Roys"], "subtitle": "Explore the new features of Microsoft Dynamics NAV 2009, and implement the solution your business needs", "topics": ["Microsoft", "Enterprise", "Microsoft Dynamics", "Enterprise Products and Platforms", "All Books"], "publication date": "2009-01-06"}
{"index": {"_id":"88"}}
{"detailed description": "Most modern machines have dual core processors. This means that multitasking is built right into your computer's hardware. Using both cores means your applications can process data faster and be more responsive to users. But to fully exploit this in your applications, you need to write multithreading code, which means learning some challenging new concepts.\nThis book will guide you through everything you need to start writing multithreaded C# applications. You will see how to use processes and threads in C#, .NET Framework features for concurrent programming, sharing memory space between threads, and much more. The book is full of practical, interesting examples and working code.\nThis book begins with the fundamental concepts such as processes, threads, mono-processor systems, multi-processor systems. As the book progresses, the readers get a clear understanding of starting, joining, pausing and restarting threads. The readers get a better understanding of the simple techniques associated with parallelism. There are short exercises at the end of every chapter for the readers to perform.\nThe book also includes several practical parallelism algorithms and data structures used for illustration, and best practices and practical topics like debugging and performance.", "isbn": "1847197108", "title": "C# 2008 and 2005 Threaded Programming: Beginner's Guide", "price_gbp": 30, "audience": "Whether you are a beginner to working with threads or an old hand that is looking for a reference, this book should be on your desk. This book will help you to build scalable, high performance software using parallel programming techniques.\nStudents learning introductory threaded programming in C# will also gain benefits from this book.", "authors": ["Gastón C. Hillar"], "subtitle": "Exploit the power of multiple processors for faster, more responsive software.", "topics": [".NET", "Microsoft", "Beginner's Guides", "Microsoft Other", "Application Development", "All Books"], "publication date": "2009-01-28"}
{"index": {"_id":"89"}}
{"detailed description": "Asterisk is the world's leading open-source PBX, telephony engine, and telephony applications toolkit with immense flexibility.\nThis book will give you a firm understanding of Asterisk Gateway Interface (AGI) development and proper AGI development practices. You will learn how to formulate Atomic AGI-enabled scripts, enabling rapid development within a well-defined Asterisk execution and runtime environment.\nThis book builds from the simplest form of an Asterisk application, the dialplan-based application, gradually building a full understanding of AGI scripting. The book also introduces a new concept of AGI development named \"Atomic AGI\" or \"Particle Programming\". It will introduce you to various techniques of interacting with the user, where user interaction isn't limited to keypad-based input, but also includes recording messages from the user, sending output to the user, and controlling the call flow.\nThe book takes a pragmatic approach with clear and complete examples, and a service development project â€” allowing you to understand the project cycle of developing an Asterisk-based service or application.", "isbn": "184719446X", "title": "Asterisk Gateway Interface 1.4 and 1.6 Programming", "price_gbp": 30, "audience": "This book is intended for developers wishing to utilize Asterisk, system administrators wishing to gain better control over their Asterisk installation, and telephony service providers wishing to deploy Asterisk-based solutions to their infrastructure. You are expected to have some experience with Asterisk and a basic understanding of programming. No knowledge of Asterisk programming is required.", "authors": ["Nir Simionovich"], "subtitle": "Design and develop Asterisk-based VoIP telephony platforms and services using PHP and PHPAGI", "topics": ["Open Source", "All Books", "Networking & Telephony", "Linux Servers", "Networking and Servers"], "publication date": "2009-02-02"}
{"index": {"_id":"90"}}
{"detailed description": "Drupal is ideally equipped to be used as a base system for creating a custom social networking site like Facebook and MySpace. While these large social networks have their place, niche social networking web sites can help promote businesses, products, projects, and hobbies of any nature.\nThis book provides careful instructions and clear explanations to take you through the setup and management of your social network site, covering topics from users to marketing to maintenance. It will help you create your own social networking site, suitable for whatever audience you decide!\nThis book will take you from the very basics of both Drupal and Social Networking right through to more complicated aspects, like creating your own custom design and features for the site. With no experience of Drupal required, the book will introduce you to this award-winning CMS and carefully take you through the steps to create a social networking site from it. As the book progresses, you will learn how to add to and expand your social networking site, adding more features and adding value for your users, and how to make your users feel part of the community. Social networking web sites rely on their users contributing to the site, and this book helps you structure a site in a way users can easily and enjoyable contribute to the site â€“ creating a powerful social network.\nThe book begins with the fundamental concepts of a Social Networking site, and how we can use Drupal to create such a site. It then goes through installing Drupal before looking at expanding the out-of-the-box feature set with third-party modules designed for Social Networking. Once the web site is running, it looks at securing the Social Network, deploying it on the Internet, and keeping it running and well maintained. It doesn't stop there however; as Social Networks rely on their user base to run and become successful, the book also covers marketing the Social Network using Search Engine Optimization, Online Marketing, and a range of new Social Media.", "isbn": "1847196101", "title": "Drupal 6 Social Networking", "price_gbp": 30, "audience": "This book is aimed at anyone looking to create their own social networking web site, including:\n\r\r\n\n\r\r\n\nBusinesses – building a Social Network around a product or service can improve your company profile and increase customer loyalty. Alternatively, an internal social network gives you employees a place to keep resources, discuss ideas, raise concerns, and keep up to date on company policies. \n\r\r\n\nHobbyists – create a community around your hobbies and interests; create a local or distributed user group. \n\r\r\n\nOrganisations & Charities – Raise your profile, promote your events / services / fundraisers and get help from the community in organizing them. \n\r\r\n\nFamilies – For large families based across the country or across the globe, keep up to date with everyone, and let everyone know what you are up to.\n\r\r\n\n\r\r\n\nYou don't need any experience of Drupal or PHP to use this book. If you are a Drupal user you will find this book a great way to rapidly tailor an existing installation into a social-orientated web site.", "authors": ["Michael Peacock"], "subtitle": "Build a social or community web site, with friends lists, groups, custom user profiles, and much more", "topics": ["Open Source", "Drupal", "Content Management (CMS)", "CMS and eCommerce", "All Books"], "publication date": "2009-02-27"}
{"index": {"_id":"91"}}
{"detailed description": "JavaScript: It's not just for calculators and image rollovers.\nDrupal 6 is loaded with new features, and not all of them are necessarily implemented in PHP. This unique book, for web designers and developers, will take you through what can be done with JavaScript (and especially with jQuery) in Drupal 6.\nWith the combination of the powerhouse jQuery library with its own robust set of JavaScript tools, Drupal 6 comes with a pre-packaged killer JavaScript environment. Cross-platform by nature, it provides all of the tools necessary to create powerful AJAX-enabled scripts, gorgeous visual effects, and view-enhancing behaviors. In addition, Drupal developers have ported some of its most powerful PHP tools – like a theming engine and support for localization and language translation – to JavaScript, making it possible to write simple scripts where once only complex PHP code could be used.\nThis book gives you the keys to the toolbox, showing you how to use Drupal's JavaScript libraries to make your modules and themes more dynamic, interactive and responsive, and add effects to make your Drupal site explode into life! \nIf you've dipped your toe in the water of theme or module development with Drupal 6, this is the book you want to make the look and behavior of your work something special. With it's project-based approach, this book is carefully constructed to guide you from how JavaScript fits into the overall Drupal architecture through to making you a master of the jQuery library in the world of Drupal themes and modules.", "isbn": "1847196160", "title": "Drupal 6 JavaScript and jQuery", "price_gbp": 30, "audience": "This book is for web designers and developers who want to add JavaScript elements to Drupal themes or modules to create more flexible and responsive user interfaces.\nYou are expected to know about the basic operation of Drupal, and be familiar with the concept of theming and modules in Drupal. No experience of creating themes or modules is required.\nYou will need to know the basics of client-side web development; this means HTML, CSS, but also have a rudimentary grasp of the syntax of JavaScript. Familiarity with PHP programming will be an advantage, since we will be writing PHPTemplate files and (at the end) creating Drupal modules. However, the PHP is covered thoroughly enough that even the PHP neophyte will not find the text too demanding. The book also covers the jQuery JavaScript library and its use in Drupal, but no knowledge of jQuery is expected - you will learn everything you need in this book.", "authors": ["Matt Butcher"], "subtitle": "Putting jQuery, AJAX, and JavaScript effects into your Drupal 6 modules and themes", "topics": ["Open Source", "All Books", "Content Management (CMS)", "AJAX", "Drupal", "jQuery", "CMS and eCommerce"], "publication date": "2009-03-09"}
{"index": {"_id":"92"}}
{"detailed description": "Django is a high-level Python web framework that was developed by a fast-moving online-news operation to meet the stringent twin challenges of newsroom deadlines and the needs of web developers. It is designed to promote rapid development and clean, pragmatic design and lets you build high-performing, elegant web applications rapidly. Django focuses on automating as much as possible and adhering to the DRY (Don’t Repeat Yourself) principle, making it easier to build high-performance web applications faster, with less code.\nThis book will show you how to assemble Django's features and take advantage of its power to design, develop, and deploy a fully-featured web site. It will walk you through the creation of an example web application, with lots of code examples.\nSpecially revised for version 1.0 of Django, the book starts by introducing the main design concepts in Django. Next, it leads you through the process of installing Django on your system. After that, you will start right away on building your social bookmarking application using Django. Various Django 1.0 components and sub-frameworks will be explained during this process, and you will learn about them by example.\nIn each chapter, you will build one or more of the features that are essential in Web 2.0 applications, like user management, tags, and AJAX. You will also learn about good software development practices, such as keeping your application secure, and automating testing with unit tests. By the end of the book, you will have built a fully functional real-life Web 2.0 application, and learned how to deploy it to a production server.", "isbn": "1847196780", "title": "Django 1.0 Website Development", "price_gbp": 30, "audience": "This book is for web developers who want to learn to build a complete site with Web 2.0 features, using the power of a proven and popular development system, Django, but do not necessarily want to learn how the complete framework functions in order to do this. Basic knowledge of Python development is required for this book, but no knowledge of Django is expected.", "authors": ["Ayman Hourieh"], "subtitle": "Build powerful web applications, quickly and cleanly, with the Django application framework", "topics": ["Web Development", "Open Source", "All Books", "Web Development"], "publication date": "2009-03-10"}
{"index": {"_id":"93"}}
{"detailed description": "Using WebForms has led to problems for ASP.NET developers, such as low testability and inconsistent code. These problems become increasingly relevant when trying to develop or maintain anything but the simplest web site.\nThis book takes you through the ASP.NET MVC framework to help you simplify and build web applications quickly. With example applications built on best practices and with clear explanations, you will get started in no time.\nThe MVC pattern is widely accepted as one of the best approaches for building modern web applications and Microsoft's new ASP.NET MVC Framework offers a fully supported way for developers to implement MVC in ASP.NET.\nThis book takes you through the essential tasks to create powerful web applications as fast as possible. These essential tasks are explained clearly, with well-structured instructions. The book does not cover every single feature in detail; it provides precise information for you to get started, and takes you through the creation of an example application that covers MVC application design techniques.\nIn addition to helping you write code, this book covers unit testing, to improve the stability and quality of the application you are building. It provides a quick reference to the MOQ framework to aid in unit testing. With this book, you will soon have the skills that will make you an ASP.NET developer to be reckoned with, and you will be creating applications with a speed that will astonish your colleagues and boss!", "isbn": "184719754X", "title": "ASP.NET MVC 1.0 Quickly", "price_gbp": 26, "audience": "This book is for ASP.NET developers who want a fast-paced guide to building powerful web applications using the ASP.NET MVC framework. All the code examples are in C#.", "authors": ["Maarten Balliauw"], "subtitle": "Design, develop, and test powerful and robust web applications with MVC framework the agile way", "topics": [".NET", "Microsoft", "Microsoft Development ", "All Books", "Application Development"], "publication date": "2009-03-16"}
{"index": {"_id":"94"}}
{"detailed description": "There are many powerful open source CMSs available to take the pain away from managing a web site. These systems are feature rich, often easy to use, and free. Unfortunately, there are so many choices it's tough to be sure you're choosing the right one. How can you be sure that you are selecting and working with the right tool?\nThis book will guide you through choosing the right CMS for your needs. You can be confident in your choice of CMS for the needs of your project. It will also help you make a start using the CMS, and give you a feel for what it's like to use it – even before you install it yourself.\nAre you bewildered by the many open source CMSs available online? Open source CMSs are the best way to create and manage sophisticated web sites. You can create a site that precisely meets your business goals, and keep the site up to date easily because these systems give you full control over every aspect of your site. Because open source CMSs are free to download, you have a huge amount of choice between the various systems.\nYet there are many open source CMSs to choose from, each with unique strengths – and occasionally limitations too. Choosing between the bewildering number of options can be tough.\nMaking the wrong choice early on may lead to a lot of wasted work, because you'll have a half-finished site that doesn't meet your initial requirements – and needs to be restarted from scratch.\nThis book will show you how to avoid choosing the wrong CMS. It will guide you through assessing your site requirements, and then using that assessment to identify the CMS that will best fit your needs. It contains discussions of the major CMSs, and the issues that you should consider when choosing: their complexity to use, their features and the power they offer. It discusses technical considerations such as programming languages and compliance with best practice standards in a clear, friendly way that non-technical readers can understand.\nThe book also contains quick-start guides and examples for the most popular CMSs such as WordPress, Joomla!, and Drupal, so that you can experiment with these CMSs, get a feel for how they work, and start using them to build your site.\nAfter reading this book, you can be confident that your CMS choice will support your web site's needs because you have carefully assessed your requirements and explored the available options.", "isbn": "1847196225", "title": "Choosing an Open Source CMS: Beginner's Guide", "price_gbp": 30, "audience": "This book is written for anyone who wants to start a web site and is looking for a good CMS. It is best suited for people who are selecting a CMS for their sites and people who will manage a CMS. Knowledge of web basics is certainly helpful, but not needed.", "authors": ["Nirav Mehta"], "subtitle": "Find the best CMS and start working with it to create web sites, blogs, communities, e-commerce sites, and intranets", "topics": ["Open Source", "Content Management (CMS)", "Beginner's Guides", "All Books", "CMS and eCommerce"], "publication date": "2009-04-17"}
{"index": {"_id":"95"}}
{"detailed description": "The Drupal View modules give you flexibility and freedom to customize the display of your web site's content. Although there are more than 100 views-enabled modules, few site administrators use Drupal Views to its full potential. \nThis book will enable you to realize the fullest potential of this powerful resource by providing a wide variety of powerful recipes for creating and displaying a wide variety of views – essential classics you will use again and again to innovative display methods that will make your Drupal site stand out. Pick and choose the ones you would like to prepare for your web site.\nIn this book you will find ninety-four recipes to create a wide selection of views. The list includes event listings, interactive calendars and timelines, maps, proximity search, podcasting, carousels, Views Fusion, and many more. You will also explore default views, views with CCK, and master a variety of ways to associate views with related content.\nMost people think of Views for site visitors. But Views can also be handy for site administrators. You will get to know the Views Bulk Operations module, along with Editable Fields, and Views Custom Fields. (You’ll probably wonder why you never used them before!)\nIf you want to take Views to the next level, the book contains a code-rich chapter on theming. However, you will find most of the recipes detailed by the author do not require any original coding at all. \nAs you progress through the recipes, you will be immersed in such Drupal Views topics as fields, arguments, filters, exposed filters, sorting, style plug-ins, formatters, cloning and copying views.\nBecause Drupal is a worldwide and ever adapting system, the author also includes great tips and resources for navigating the online Drupal community and expanding your knowledge of the recipes.\nFinally, there is an extensive Appendix, which includes listings of all default views, formatters and style plug-ins for Drupal 5, along with a categorized list of patches.", "isbn": "1847196969", "title": "Drupal 5 Views Recipes", "price_gbp": 37, "audience": "This book is primarily written for Drupal site builders, administrators, and themers who want to develop custom content displays using Views. It can be used by anyone who has a Drupal 5 web site, including original site developers as well as people who have inherited a Drupal 5 site.\nSome knowledge of HTML and CSS is required; PHP basics will be handy for some of the recipes.\n\r\r\n\n ", "authors": ["Marjorie Roswell"], "subtitle": "94 recipes to develop custom content displays for your Drupal web site", "topics": ["Open Source", "Drupal", "Content Management (CMS)", "All Books", "CMS and eCommerce"], "publication date": "2009-05-27"}
{"index": {"_id":"96"}}
{"detailed description": "Web development is tricky—even a simple web application has a number of context changes ready to trip up the unwary. Grails takes the everyday pain out of web application development, allowing us to focus on delivering real application logic and create seamless experiences that will address the needs of our users. This book will take the pain out of Grails by showing you exactly how to build a web application with a minimum of fuss.\nWith this book, even if you are new to Grails, you will be up and running before you know it. You will be able to code faster and your code will be better. This clear and concise book is packed with examples and clear instructions to help you build your first Grails application and gives you the skills to speed up your application development by adding a different angle for learning about the topic. After a brief introduction to the dynamic JVM-based Groovy programming language, which teaches you enough about Groovy to understand the relationship between Grails and the Groovy scripting language, it shows how to use Grails and a number of key plug-ins to deliver valuable web applications. It also takes you through creating, developing, testing, and deploying an example team collaboration application in Grails.\nUsing an incremental and iterative approach you will learn how to build a basic web application with secure authentication and different levels of authorization. You will learn how to handle file upload allowing users to share files. Some advanced features of object-oriented persistence will be introduced through adding tags for messages and files to giving users a robust categorization system.\nYou will then build on the basic application to enhance the user experience through AJAX and the RichUI plug-in. You will take a further step into the world of Web 2.0 by adding an RSS feed and a REST service to the application. Once the entire application is up and running, you will learn how to create your own plug-in for tagging. Finally, you will learn how to deploy this application to a production environment.", "isbn": "1847196683", "title": "Grails 1.1 Web Application Development", "price_gbp": 30, "audience": "This book is aimed at Java web developers looking for ways to build web applications quickly, and wanting to find out how it's done quickly. If you are frustrated with integrating the many different frameworks that are available for web development and want to get on with building slick web applications for your users, then this book is for you. Grails is built on the Groovy language, but experience in Groovy is not required, as you will learn enough about Groovy to understand how to use Grails.", "authors": ["Jon Dickinson"], "subtitle": "Reclaiming Productivity for faster Java Web Development", "topics": ["Web Development", "Open Source", "Java", "All Books", "Web Development"], "publication date": "2009-05-27"}
{"index": {"_id":"97"}}
{"detailed description": "Due to its power and expandability, Drupal has become one of the most popular open source content management systems. At the same time, Flash has been adopted for its ability to create beautiful and dynamic web applications. By combining these technologies, you can create Flash applications that are both visually stunning and rich in content.\nThis book is an in depth discussion and tutorial on how to integrate Flash applications with Drupal CMS. It will describe the best techniques and practices for integrating Flash technology with the power and flexibility of Drupal by building real-life Flash applications.\nWithin this book, you will learn how to build Flash applications that show text from within Drupal and also present images, music, and video within a single Flash application. You will also be able to take advantage of the expandable fields and content filtering provided from the CCK and Views modules to add flexibility and power to your Flash applications. Finally, you will learn how to add your own custom functionality to Drupal and then utilize that from within your Flash applications leaving you with a world of possibilities.\nThis book starts out with a simple introduction to Flash and Drupal technology where you will create a simple Flash application and then embed that within Drupal. From there, each subsequent chapter builds on the previous chapters tackling a new and challenging task.\nFor each new task, you will take a step-by-step approach to building a real-life application that utilizes the feature introduced within that chapter. You will also explore alternative design approaches that will eliminate the current design challenges that developers face when building Flash-driven Drupal sites; and all this while staying true to the Object Oriented Principles that govern the foundation of the ActionScript 3 language. By the end of this book, you will be able to apply all the lessons learned from this book to any other use case you may encounter.", "isbn": "1847197582", "title": "Flash with Drupal", "price_gbp": 34, "audience": "This book is written for developers who wish to build dynamic flash applications. Although we will be using Drupal for our Content Management System, the lessons learned within this book can easily be applied to other content management systems such as Joomla or WordPress. Because of this, you are not assumed to be familiar with Drupal. Any interaction with Drupal will be described in full detail so that anyone can follow along. As for Flash, it is not necessary to be familiar with how to use Flash since that too will be covered within this book. However, it is recommended that you have some modest understanding of ActionScript and PHP since there are many code examples within this book.", "authors": ["Travis Tidwell"], "subtitle": "Build dynamic, content-rich Flash CS3 and CS4 applications for Drupal 6", "topics": ["Open Source", "Content Management (CMS)", "Flash", "All Books", "Drupal", "CMS and eCommerce"], "publication date": "2009-05-27"}
{"index": {"_id":"98"}}
{"detailed description": "Alfresco 3.0 has generated a lot of curiosity with its new content management features. Users have been waiting for a book that covers these concepts along with the security, dashboards, and configuration features of Alfresco 3. \nAlfresco 3 includes Alfresco Surf, a new N-Tier Architecture, which delivers scalability and accommodates more users on existing hardware resources. This new release also includes a draft implementation of the CMIS specification, and Microsoft Office SharePoint Protocol support. The new multi-tenancy features enable Alfresco ECM to be configured as a single-instance multi-tenant environment.\nThis well-crafted and easy-to-use book is a complete guide to implementing enterprise content management in your business using Alfresco 3. It covers the enhanced document management, a new web-based collaborative application called Alfresco Share, and various integration options with external applications.\nAlfresco 3 offers true Enterprise Content Management (ECM) by providing an open source alternative to Microsoft SharePoint, Documentum, and Interwoven. It is the most popular Java-based CMS with over 1.5 million downloads, 50,000 live sites, 74,000 community members, and with more than 150 application extensions in forge. This book guides you through creating smart, collaborative content repositories and shows how to use Alfresco 3 to create more elegant document sharing, better collaborative working, and reliable automated workflow processes.\nThe book also explains how administrators can set up Alfresco 3 for multiple business units as a single-instance multi-tenant environment. Business users can leverage Alfresco Share, a new built-in web-based collaborative content management application bundled with Alfresco repository. It simplifies capturing, sharing, and retrieval of information across virtual teams.\nThis book shows you how to unleash the power of Alfresco 3 to create collaborative working systems in your enterprise", "isbn": "1847197361", "title": "Alfresco 3 Enterprise Content Management Implementation", "price_gbp": 44, "audience": "This book is designed for system administrators, experienced users, and business owners who want to install and use Alfresco in their teams or businesses. Because Alfresco is free, many teams can install and experiment with its ECM features without any upfront cost, often without management approval. The book assumes a degree of technical confidence but does not require specialist system administration or developer skills to get a basic system up and running.\nAlfresco is particularly suitable for IT consultants who want or need to set up a flexible enterprise content management system for their clients, be that for demonstration, development, or as a mission-critical platform. This book gets you to that result quickly and effectively.\nThough this book is not a developer guide, various examples in the book will help developers to extend Alfresco functionality and to integrate Alfresco with external systems.", "authors": ["Vinita Choudhary", "Pallika Majmudar", "Munwar Shariff", "Amita Bhandari"], "subtitle": "How to customize, use, and administer this powerful, Open Source Java-based Enterprise CMS", "topics": ["Open Source", "Java", "Content Management (CMS)", "Alfresco", "CMS and eCommerce", "All Books"], "publication date": "2009-06-10"}
{"index": {"_id":"99"}}
{"detailed description": "Struts 2.1 is a modern, extensible, agile web application framework suitable for both small- and large-scale web applications.\nThe book begins with a comprehensive look at Struts 2.1 basics, interspersed with detours into more advanced development topics. You'll learn about configuring Struts 2.1 actions, results, and interceptors via both XML and Java annotations. You'll get an introduction to most of the Struts 2.1 custom tags and learn how they can assist in rapid application prototyping and development.\nFrom there you'll make your way into Struts 2.1's strong support for form validation and type conversion, which allows you to treat your form values as domain objects without cluttering your code. A look at Struts 2.1's interceptors is the final piece of the Struts 2.1 puzzle, allowing you to leverage the standard Struts 2 interceptors as well as implement your own custom behavior.\nAfter covering Struts 2.1 you'll journey into the world of JavaScript, a surprisingly capable language, the Document Object Model (DOM), and CSS, and learn how to create clean and concise client-side behavior. You'll leverage that knowledge as you move on to Struts 2 themes and templates, which give you a powerful way to encapsulate site-wide user interface behavior.\nThe book closes with a look at some tools that make the application development life cycle easier to manage, particularly in a team environment, and more automatic.", "isbn": "1847193390", "title": "Apache Struts 2 Web Application Development", "price_gbp": 26, "audience": "This book is for Java developers who are interested in developing web applications using Struts. If you need a comprehensive introduction to Struts 2.1, along with the most important aspects of additional web application development technologies, agile programming practices, tool creation, and application life cycle management this book is for you. You don't need to know JavaScript and CSS to use this book as the author will teach you the required basics.\nIf you are a Struts 1 or WebWork user and wish to go ahead and migrate to Struts 2, this practical guide is also for you.", "authors": ["Dave Newton "], "subtitle": "A beginner’s guide for Java developers", "topics": ["Open Source", "All Books", "Web Development"], "publication date": "2009-06-15"}
{"index": {"_id":"100"}}
{"detailed description": "ASP.NET 3.5 is equipped with a built-in security system, standard design templates, and easy configurations for database connections, which make it the ideal language for building a content management system. With the strong community support for the ASP.NET platform, you can be assured that what you write today will be around and supported for years to come. You can imagine how easy it is to get lost in the myriad features especially if you are a newcomer.\nThis book shows you how to make use of ASP.NET's features and create a functional Content Management System quickly and conveniently. You will learn how to build your site and see the different ways in which you can customize your code to fit your needs. With this book in hand, you can easily set up users and groups, create valuable content for your users, and manage the layout of your site efficiently. All you need is a basic understanding of coding and a desire to learn, and this book will take care of the rest.\nThis book will teach you to get your site up and running quickly, and maintain its content even if you have little or no web design or programming experience. It will give you all the knowledge you need to use the tools as well as the code required to make yourself a strong developer far beyond your site. It begins with setting up your programming environment and coding a Content Management System. You will learn how to install and configure a database and connect it to your CMS. You will be able to create content and manage the layout of your site, and also make it available beyond the browser. At the end of this book, you will have designed and built a CMS that allows you to administer an Articles section, Images and Files sections, as well as a full set of Administrator tools for your site.", "isbn": "1847193617", "title": "ASP.NET 3.5 CMS Development", "price_gbp": 30, "audience": "This book is for beginner to intermediate ASP.NET users who have managed to learn Visual Web Developer and want to take on their first real-world application. It will help those who have used SQL Server Express, completed a few sample projects, and now wish to explore a Content Management System.", "authors": ["Jeff Cochran", "Curt Christianson"], "subtitle": "Build, Manage, and Extend your own Content Management System", "topics": ["Open Source", "Content Management (CMS)", "All Books", "CMS and eCommerce"], "publication date": "2009-06-25"}
{"index": {"_id":"101"}}
{"detailed description": "Flex 3 is a great technology for developing Rich Internet Applications for the Web as well as for the desktop. If you are a developer looking to design great-looking and sophisticated user interfaces that resemble desktop-based applications, and want to utilize an existing server technology such as Java to develop RIAs, this book is for you.\nTargeting developers who want to get started with Adobe Flex 3 programming, this simple and clear handbook introduces Flex technology quickly and straightforwardly. Utilizing your existing knowledge of Java, it gives you the insight and hands-on experience to program with Flex 3.\nThis book provides comprehensive information on various aspects of Flex 3 and ActionScript 3.0. These include developing simple applications, handling events, creating custom components and events, using RPC services, integration with Java and BlazeDS, styling and formatting, and how to package and deploy Flex applications.\nYou will start with downloading, installing and configuring Flex 3 SDK and Flex Builder 3 and learn basic concepts such as what MXML and ActionScript are, understanding UI components, controls, compilers, and more. Further you will develop simple applications and slowly advance into more depth where you will learn advanced concepts such as creating custom components, debugging, integrating with Java, using RPC services, styling, internationalizing, and deploying Flex applications, and more.\nOne of the things you're really going to love about this book is that you will develop a full-blown e-commerce application using a combination of Flex 3, ActionScript 3.0, BlazeDS 3.2, and Java. At the end of the book you will have the knowledge and experience needed to develop Rich Internet Applications.", "isbn": "1847195342", "title": "Flex 3 with Java", "price_gbp": 30, "audience": "This book is a good starting point for any developer with a little experience in Java programming to get going with Adobe Flex 3 and ActionScript 3.0 development. You may be a software developer/professional who wishes to learn and understand Flex 3 technology for developing Rich Internet Applications. If you are a system analyst who wants to explore and understand Flex 3 then this is an ideal book for you.", "authors": ["Satish Kore"], "subtitle": "Develop rich internet applications quickly and easily using Adobe Flex 3, ActionScript 3.0 and integrate with a Java backend using BlazeDS 3.2", "topics": ["Open Source", "Java", "All Books", "Application Development"], "publication date": "2009-06-26"}